-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Sep 08, 2025 at 10:09 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `clinic_db2`
--

-- --------------------------------------------------------

--
-- Table structure for table `diagnoses`
--

CREATE TABLE `diagnoses` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `diagnoses`
--

INSERT INTO `diagnoses` (`id`, `name`, `created_at`, `updated_at`) VALUES
(1, '', '0000-00-00 00:00:00', '2025-04-13 14:38:35'),
(2, 'Cao huyết áp', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(3, 'Tiểu đường type 2', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(4, 'Viêm phế quản', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(5, 'Rối loạn tiêu hóa', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(6, 'Đau dạ dày', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(7, 'Cảm cúm thông thường', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(8, 'Viêm da cơ địa', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(9, 'Thoái hóa khớp gối', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(10, 'Suy nhược cơ thể', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(126, '1', '2025-05-23 15:11:54', '2025-05-23 15:11:54'),
(127, 'Tăng huyết áp, ĐTĐ', '2025-05-30 05:57:52', '2025-05-30 05:57:52'),
(128, 'Tăng huyết áp', '2025-05-31 04:14:23', '2025-05-31 04:14:23'),
(129, 'Viêm phổi', '2025-05-31 13:17:13', '2025-05-31 13:17:13'),
(130, 'Viêm họng', '2025-06-01 00:48:09', '2025-06-01 00:48:09'),
(131, 'Nhân xơ tử cung', '2025-06-01 01:06:43', '2025-06-01 01:06:43'),
(132, 'Kiểm tra sức khỏe', '2025-06-01 22:50:26', '2025-06-01 22:50:26'),
(133, 'Kiểm tra', '2025-06-02 05:34:22', '2025-06-02 05:34:22'),
(134, 'liểm tra', '2025-06-02 12:32:21', '2025-06-02 12:32:21'),
(135, 'Đau bụng', '2025-06-05 12:43:37', '2025-06-05 12:43:37'),
(136, 'TD Gout', '2025-06-05 13:09:50', '2025-06-05 13:09:50'),
(137, 'Chấn thương ngực', '2025-06-07 01:33:27', '2025-06-07 01:33:27'),
(138, 'Đau lưng', '2025-06-07 10:32:58', '2025-06-07 10:32:58'),
(139, 'TD Lao phổi', '2025-06-12 04:34:10', '2025-06-12 04:34:10'),
(140, 'Chấn thương cổ chân', '2025-06-12 11:40:02', '2025-06-12 11:40:02'),
(141, 'Kiểm tra - chóng mặt, đau đầu', '2025-06-12 22:55:11', '2025-06-12 22:55:11'),
(142, 'Đau cơ, sỏi thận', '2025-06-13 05:53:48', '2025-06-13 05:53:48'),
(143, 'Viêm tai giữa', '2025-06-13 05:55:41', '2025-06-13 05:55:41'),
(144, 'Tiêu chảy', '2025-06-13 23:53:54', '2025-06-13 23:53:54'),
(145, 'Kiểm tra thau', '2025-06-14 11:21:56', '2025-06-14 11:21:56'),
(146, 'Hạch viêm góc hàm hai bên', '2025-06-16 11:09:50', '2025-06-16 11:09:50'),
(147, 'Hạch viêm góc hàm phải', '2025-06-16 11:28:40', '2025-06-16 11:28:40'),
(148, 'E78. Rối loạn lipid máu, hở van 2 lá 2/4', '2025-06-17 05:39:40', '2025-06-17 05:39:40'),
(149, 'Sán chó', '2025-06-17 05:46:13', '2025-06-17 05:46:13'),
(150, 'HP (+), Trào ngực dạ dày, K20', '2025-06-17 13:16:47', '2025-06-17 13:16:47'),
(151, 'Đau ngực', '2025-06-18 04:21:34', '2025-06-18 04:21:34'),
(152, 'Thiếu máu cục bộ cơ tim, Đau cơ.', '2025-06-18 04:43:17', '2025-06-18 04:43:17'),
(153, 'Trễ kinh', '2025-06-18 10:09:19', '2025-06-18 10:09:19'),
(154, 'U phổi, tiêu chảy, Ngứa', '2025-06-19 10:14:31', '2025-06-19 10:14:31'),
(155, 'Thoái hóa khớp gối phải', '2025-06-20 05:48:25', '2025-06-20 05:48:25'),
(156, 'Đái tháo đường tuyp II, thoái hóa khớp gối, suy tuyến thương thận, viêm dạ dày.', '2025-06-20 22:47:43', '2025-06-20 22:47:43'),
(157, 'Tiền ĐTĐ, Tăng lipid máu, TD Carcinoma, HP (+)', '2025-06-21 01:54:11', '2025-06-21 01:54:11'),
(158, 'Viêm dạ dày,', '2025-06-21 02:43:27', '2025-06-21 02:43:27'),
(159, 'Viêm dạ dày, TD Viêm xoang, ', '2025-06-21 02:43:59', '2025-06-21 02:43:59'),
(160, 'Tăng lipid máu, tăng men gan, khó tiêu chức năng', '2025-06-21 03:50:13', '2025-06-21 03:50:13'),
(161, 'Nhịp nhanh xoang, không đều, hở van 3 lá, ĐMC trung bình, đau cơ, khó tiêu chức năng', '2025-06-21 04:08:30', '2025-06-21 04:08:30'),
(162, 'Viêm + Thoái hóa khớp gối', '2025-06-21 04:10:42', '2025-06-21 04:10:42'),
(163, 'Chấn thương gối phải', '2025-06-23 04:25:44', '2025-06-23 04:25:44'),
(164, 'Suy van tĩnh mạch chi dưới hai bên', '2025-06-23 10:45:44', '2025-06-23 10:45:44'),
(165, 'TD viêm phổi', '2025-06-23 11:47:59', '2025-06-23 11:47:59'),
(166, 'Đau vai gáy', '2025-06-24 10:15:41', '2025-06-24 10:15:41'),
(167, 'Thoái hóa cột sống cổ/ xơ vữa hành cảnh/ trào ngược dạ dày', '2025-06-24 10:47:57', '2025-06-24 10:47:57'),
(168, 'Nhân giáp', '2025-06-24 11:36:02', '2025-06-24 11:36:02'),
(169, 'Thai quí', '2025-06-25 04:18:38', '2025-06-25 04:18:38'),
(170, 'Viêm dạ dày, đau ngực', '2025-06-25 11:17:16', '2025-06-25 11:17:16'),
(171, 'Tăng Acid uric, tăng GGT', '2025-06-26 05:12:33', '2025-06-26 05:12:33'),
(172, 'Tăng lipid, thiếu máu não', '2025-06-26 11:10:37', '2025-06-26 11:10:37'),
(173, 'Tăng GGT, Xơ vữa động mạch cảnh', '2025-06-27 05:27:39', '2025-06-27 05:27:39'),
(174, 'Thoát vị bẹn trái.', '2025-06-27 11:09:12', '2025-06-27 11:09:12'),
(175, 'TD Hội chứng ống cổ tay.', '2025-06-27 12:04:34', '2025-06-27 12:04:34'),
(176, 'Hạch viêm thương đòn', '2025-06-28 07:33:40', '2025-06-28 07:33:40'),
(177, 'Toxocara (+)', '2025-06-28 23:29:11', '2025-06-28 23:29:11'),
(178, 'Đái tháo đường tuyp II', '2025-06-29 00:32:47', '2025-06-29 00:32:47'),
(179, 'Đau cơ.', '2025-06-29 03:58:49', '2025-06-29 03:58:49'),
(180, 'Thoái hóa cột sống, RLTĐ', '2025-06-29 04:40:51', '2025-06-29 04:40:51'),
(181, 'Viêm bàng quang, đau lưng', '2025-07-01 05:02:43', '2025-07-01 05:02:43'),
(182, 'Đau khớp', '2025-07-01 11:31:56', '2025-07-01 11:31:56'),
(183, 'Viêm phổi/ Lao phổi', '2025-07-02 04:32:48', '2025-07-02 04:32:48'),
(184, 'Ngứa', '2025-07-02 10:53:08', '2025-07-02 10:53:08'),
(185, 'Kiểm tra thai', '2025-07-02 11:19:45', '2025-07-02 11:19:45'),
(186, 'Nhiễm trung tiểu, đau cơ', '2025-07-03 04:30:09', '2025-07-03 04:30:09'),
(187, 'Thoái hóa khớp gối, đau cơ.', '2025-07-03 11:07:40', '2025-07-03 11:07:40'),
(188, 'Vết thương ngón II, bàn tay trái', '2025-07-03 11:11:05', '2025-07-03 11:11:05'),
(189, 'RLTĐ', '2025-07-03 13:27:46', '2025-07-03 13:27:46'),
(190, 'Đái tháo đường tuyp II, Giảm độ lọc cầu thận, lao kháng trị, mất ngủ', '2025-07-04 04:48:45', '2025-07-04 04:48:45'),
(191, 'Nhồi máu não, Đái thóa đường tuýp II,  Tăng huyết áp, tăng lipid máu', '2025-07-04 04:59:49', '2025-07-04 04:59:49'),
(192, 'Nhồi máu não, Đái tháo đường tuýp II,  Tăng huyết áp, tăng lipid.', '2025-07-04 05:04:13', '2025-07-04 05:04:13'),
(193, 'viêm mũi dị ứng', '2025-07-04 05:13:44', '2025-07-04 05:13:44'),
(194, 'Nhồi máu não, Đái tháo đường tuýp II,  Tăng huyết áp, tăng lipid, tăng men gan', '2025-07-04 05:43:26', '2025-07-04 05:43:26'),
(195, 'U vú phải Birads 5, HP(+), tăng lipid.', '2025-07-05 00:22:53', '2025-07-05 00:22:53'),
(196, 'Toxocara (+), tăng men gan, gout.', '2025-07-05 00:39:37', '2025-07-05 00:39:37'),
(197, 'Kiểm tra - chóng mặt, đau đầu, đau ngực, viêm xoang.', '2025-07-05 01:09:40', '2025-07-05 01:09:40'),
(198, 'Viêm xoang, nhịp tim chậm xoang, đau thần kinh liên sườn, mất ngủ', '2025-07-05 02:23:54', '2025-07-05 02:23:54'),
(199, 'Kiểm tra vòng tránh thai.', '2025-07-05 02:33:08', '2025-07-05 02:33:08'),
(200, 'Viêm âm đạo', '2025-07-05 02:45:16', '2025-07-05 02:45:16'),
(201, 'Đau đầu, chóng mặt', '2025-07-05 03:27:51', '2025-07-05 03:27:51'),
(202, 'Rối loạn chức năng tiền đình, thiếu máu não, đau lưng.', '2025-07-05 03:57:21', '2025-07-05 03:57:21'),
(203, 'Chấn thương gối trái', '2025-07-06 00:25:34', '2025-07-06 00:25:34'),
(204, 'Viêm mũi, họng cấp', '2025-07-06 00:58:41', '2025-07-06 00:58:41'),
(205, 'Viêm gan siêu vi B mạn.', '2025-07-06 01:32:34', '2025-07-06 01:32:34'),
(206, 'Khó tiêu, tiêu chảy, đau ngực', '2025-07-08 23:08:05', '2025-07-08 23:08:05'),
(207, 'Khó tiêu, tiêu chảy, đau ngực, TMCT, Hở van 2 lá 1.5/4, tăng acid uric,', '2025-07-09 00:08:09', '2025-07-09 00:08:09'),
(208, 'Đau lưng, tăng huyết áp', '2025-07-09 04:07:40', '2025-07-09 04:07:40'),
(209, 'Thoái hóa cột sống thắt lưng, tăng huyết áp, sỏi thận.', '2025-07-09 04:34:20', '2025-07-09 04:34:20'),
(210, 'Kiểm tra, đau họng', '2025-07-09 10:36:27', '2025-07-09 10:36:27'),
(211, 'Toxocara (+), tăng men gan, gout, đái tháo đường tuyp II.', '2025-07-09 13:40:34', '2025-07-09 13:40:34'),
(212, 'Kiểm tra, đái tháo đường tuyp II, Tăng huyết áp.', '2025-07-09 23:31:04', '2025-07-09 23:31:04'),
(213, 'Đau lưng, đau bụng', '2025-07-10 04:20:37', '2025-07-10 04:20:37'),
(214, 'Chấn thương cổ tay phải.', '2025-07-10 05:07:49', '2025-07-10 05:07:49'),
(215, 'Rối loạn tiêu hóa, khó tiêu chức năng', '2025-07-10 10:37:57', '2025-07-10 10:37:57'),
(216, 'Chóng mặt', '2025-07-10 11:23:23', '2025-07-10 11:23:23'),
(217, 'Thiếu máu não, rối loạn tiền đình, rối loạn tiêu hóa.', '2025-07-11 11:26:44', '2025-07-11 11:26:44'),
(218, 'TD bệnh lý tuyến giúp', '2025-07-11 23:21:41', '2025-07-11 23:21:41'),
(219, 'Đái tháo đường tuyp II, tăng lipid', '2025-07-12 00:19:58', '2025-07-12 00:19:58'),
(220, 'Đái tháo đường tuyp II, tăng men gan, tăng lipid.', '2025-07-12 02:53:22', '2025-07-12 02:53:22'),
(221, 'Đau họng, ', '2025-07-12 03:01:16', '2025-07-12 03:01:16'),
(222, 'Chấn thương bàn chân phải.', '2025-07-12 04:38:03', '2025-07-12 04:38:03'),
(223, 'Gãy xương đốt xa ngón IV, bàn chân phải.', '2025-07-12 04:58:53', '2025-07-12 04:58:53'),
(224, 'Ho, đau bụng', '2025-07-12 08:12:37', '2025-07-12 08:12:37'),
(225, 'Nhiễm trung tiêu hóa', '2025-07-12 08:41:48', '2025-07-12 08:41:48'),
(226, 'Nhiễm trùng bàn chân trái.', '2025-07-12 23:48:33', '2025-07-12 23:48:33'),
(227, 'K21. ', '2025-07-13 00:30:27', '2025-07-13 00:30:27'),
(228, 'Đau ngực, viêm dạ dày.', '2025-07-13 00:40:11', '2025-07-13 00:40:11'),
(229, 'HP +', '2025-07-13 01:07:48', '2025-07-13 01:07:48'),
(230, 'Tăng men gan, tăng lipid', '2025-07-13 02:41:54', '2025-07-13 02:41:54'),
(231, 'Chấn thương bàn chân trái', '2025-07-13 07:52:45', '2025-07-13 07:52:45'),
(232, 'Gãy xương đốt gần ngón IV, bàn chân trái.', '2025-07-13 08:06:42', '2025-07-13 08:06:42'),
(233, 'Đau gót trái', '2025-07-13 08:32:30', '2025-07-13 08:32:30'),
(234, 'Gai xương gót trái.', '2025-07-13 08:44:30', '2025-07-13 08:44:30'),
(235, 'Đau bụng chưa rõ nguyên nhân', '2025-07-13 22:46:23', '2025-07-13 22:46:23'),
(236, 'Đau thần kinh liên sườn, Viêm gan siêu vi B mạn', '2025-07-13 23:43:07', '2025-07-13 23:43:07'),
(237, 'Thoát vị bẹn phải.', '2025-07-14 04:04:06', '2025-07-14 04:04:06'),
(238, 'Sốt', '2025-07-14 23:25:32', '2025-07-14 23:25:32'),
(239, 'Kiểm tra.', '2025-07-15 05:03:22', '2025-07-15 05:03:22'),
(240, 'Đau ngực, tăng huyết áp', '2025-07-15 10:13:52', '2025-07-15 10:13:52'),
(241, 'Khó tiêu', '2025-07-15 10:29:03', '2025-07-15 10:29:03'),
(242, 'Đau thần kinh liên sườn', '2025-07-16 04:24:13', '2025-07-16 04:24:13'),
(243, 'Đau lưng, TD bệnh lý thận mạn', '2025-07-16 04:58:12', '2025-07-16 04:58:12'),
(244, 'Biến ăn', '2025-07-16 05:00:33', '2025-07-16 05:00:33'),
(245, 'Sốt ngày 5', '2025-07-16 11:11:32', '2025-07-16 11:11:32'),
(246, 'Ho', '2025-07-17 12:54:42', '2025-07-17 12:54:42'),
(247, 'Gãy xương sườn số 7 bên trái.', '2025-07-18 04:35:53', '2025-07-18 04:35:53'),
(248, 'TD Viêm phổi. ', '2025-07-18 10:42:43', '2025-07-18 10:42:43'),
(249, 'Toxocara (+), sỏi thận, tăng Lipid, HP(+)', '2025-07-18 11:37:25', '2025-07-18 11:37:25'),
(250, 'Kiểm tra, ngứa', '2025-07-19 01:23:50', '2025-07-19 01:23:50'),
(251, 'HP (+), Trào ngực dạ dày, K20, ngứa', '2025-07-19 02:07:03', '2025-07-19 02:07:03'),
(252, 'Chấn thương vùng mông', '2025-07-19 04:07:00', '2025-07-19 04:07:00'),
(253, 'Sốt xuất huyết', '2025-07-19 08:05:04', '2025-07-19 08:05:04'),
(254, 'Sốt ngày 2', '2025-07-19 11:09:35', '2025-07-19 11:09:35'),
(255, 'Sốt ngày 3', '2025-07-20 11:21:38', '2025-07-20 11:21:38'),
(256, 'HP (+), tang lipid', '2025-07-21 04:58:57', '2025-07-21 04:58:57'),
(257, 'Đau vai gáy, trào nguwcowjc dạ dày', '2025-07-21 05:14:46', '2025-07-21 05:14:46'),
(258, 'RLTĐ, đau lưng', '2025-07-21 05:57:56', '2025-07-21 05:57:56'),
(259, 'HP (+), EF giảm, hở van tim 3 lá 3/4, hả van 2 lá 3/4, tăng huyết áp', '2025-07-21 11:25:29', '2025-07-21 11:25:29'),
(260, 'Đau bung HP (+)', '2025-07-22 10:35:50', '2025-07-22 10:35:50'),
(261, 'Chấn thương gối phải.', '2025-07-22 10:57:02', '2025-07-22 10:57:02'),
(262, 'thương đầu', '2025-07-22 11:40:41', '2025-07-22 11:40:41'),
(263, 'Kiểm tra, vết thương hở ngón I, bàn chân trái.', '2025-07-22 23:04:03', '2025-07-22 23:04:03'),
(264, 'Đái tháo đường tuyp I.', '2025-07-23 04:40:43', '2025-07-23 04:40:43'),
(265, 'Chấn thương vai phải', '2025-07-24 04:06:57', '2025-07-24 04:06:57'),
(266, 'Viêm phổi.', '2025-07-24 04:41:18', '2025-07-24 04:41:18'),
(267, 'Viêm khớp', '2025-07-24 04:46:12', '2025-07-24 04:46:12'),
(268, 'Viêm amydal', '2025-07-24 05:11:56', '2025-07-24 05:11:56'),
(269, 'Chấn thương cổ bàn chân phải.', '2025-07-25 10:36:45', '2025-07-25 10:36:45'),
(270, 'Chấn thương cổ chân phải.', '2025-07-25 12:06:58', '2025-07-25 12:06:58'),
(271, 'Trào ngược dạ dày, viêm họng', '2025-07-25 12:28:41', '2025-07-25 12:28:41'),
(272, 'Đau thượng vị', '2025-07-25 23:05:24', '2025-07-25 23:05:24'),
(273, 'Đau lưng, đau khớp thái dương hàm', '2025-07-26 01:47:36', '2025-07-26 01:47:36'),
(274, 'Gãy cũ xương đòn trái.', '2025-07-26 02:05:29', '2025-07-26 02:05:29'),
(275, 'Răng mọc lệch', '2025-07-26 05:33:41', '2025-07-26 05:33:41'),
(276, 'Kiểm tra, đau đầu', '2025-07-27 09:34:15', '2025-07-27 09:34:15'),
(277, 'Sỏi thận', '2025-07-27 11:37:31', '2025-07-27 11:37:31'),
(278, 'Thai quí 2', '2025-07-27 12:01:42', '2025-07-27 12:01:42'),
(279, 'DDauu bungnn', '2025-07-28 18:39:17', '2025-07-28 18:39:17'),
(280, 'scjskkkk', '2025-07-28 18:40:32', '2025-07-28 18:40:32'),
(281, 'sssssasasasas', '2025-08-02 04:15:39', '2025-08-02 04:15:39'),
(282, 'sssssadassdasdasd', '2025-08-02 04:17:19', '2025-08-02 04:17:19'),
(283, '12dx', '2025-08-02 04:18:47', '2025-08-02 04:18:47'),
(284, 'sdfds', '2025-08-02 04:20:24', '2025-08-02 04:20:24'),
(285, 'éo má', '2025-08-02 04:20:53', '2025-08-02 04:20:53'),
(286, 'sssadssadx', '2025-08-02 04:21:11', '2025-08-02 04:21:11'),
(287, '132121213123213213', '2025-08-02 04:24:49', '2025-08-02 04:24:49'),
(288, '123123123', '2025-08-02 04:24:52', '2025-08-02 04:24:52'),
(289, 'sdad', '2025-08-02 04:25:08', '2025-08-02 04:25:08'),
(290, 'Thoái hóa khớp gối2343424', '2025-08-02 04:31:21', '2025-08-02 04:31:21');

-- --------------------------------------------------------

--
-- Table structure for table `doctor_notes`
--

CREATE TABLE `doctor_notes` (
  `id` int(11) NOT NULL,
  `content` varchar(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `doctor_notes`
--

INSERT INTO `doctor_notes` (`id`, `content`, `created_at`, `updated_at`) VALUES
(1, '', '0000-00-00 00:00:00', '2025-04-13 14:37:57'),
(2, 'Theo dõi huyết áp hàng ngày, tái khám sau 1 tháng.', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(3, 'Kiểm soát đường huyết, ăn kiêng, tập thể dục.', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(4, 'Giữ ấm cơ thể, tránh khói bụi, tái khám nếu ho kéo dài.', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(5, 'Ăn chín uống sôi, tránh đồ ăn khó tiêu.', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(6, 'Uống thuốc đúng giờ, kiêng chua cay, tái khám sau 2 tuần.', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(7, 'Vệ sinh mũi họng, nghỉ ngơi tại nhà.', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(8, 'Giữ vệ sinh da, tránh tiếp xúc dị nguyên, bôi thuốc theo chỉ định.', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(10, 'Bổ sung dinh dưỡng, nghỉ ngơi hợp lý, tránh căng thẳng.', '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(11, 'Uống thuốc đúng giờ, theo toa', '2025-07-25 15:30:21', '2025-07-25 15:30:21');

-- --------------------------------------------------------

--
-- Table structure for table `examinations`
--

CREATE TABLE `examinations` (
  `id` bigint(20) NOT NULL,
  `patient_id` bigint(20) NOT NULL,
  `reason` varchar(100) DEFAULT NULL,
  `diagnosis_id` int(11) NOT NULL,
  `doctor_note_id` int(11) NOT NULL,
  `note` varchar(255) DEFAULT NULL,
  `pulse` varchar(50) DEFAULT NULL,
  `blood_pressure` varchar(50) DEFAULT NULL,
  `respiratory_rate` varchar(50) DEFAULT NULL,
  `weight` varchar(50) DEFAULT NULL,
  `height` varchar(50) DEFAULT NULL,
  `temperature` varchar(50) DEFAULT NULL,
  `type` enum('chỉ định','toa thuốc') NOT NULL,
  `follow_up` varchar(15) DEFAULT NULL,
  `price` int(11) DEFAULT NULL,
  `state` varchar(10) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `examinations`
--

INSERT INTO `examinations` (`id`, `patient_id`, `reason`, `diagnosis_id`, `doctor_note_id`, `note`, `pulse`, `blood_pressure`, `respiratory_rate`, `weight`, `height`, `temperature`, `type`, `follow_up`, `price`, `state`, `created_at`, `updated_at`) VALUES
(1324, 527, NULL, 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'toa thuốc', '02/08/2025', 0, 'Chưa gọi', '2025-08-02 06:01:00', '2025-08-02 06:01:00'),
(1327, 527, '', 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 240000, 'Chưa gọi', '2025-08-02 06:01:51', '2025-08-02 06:01:51'),
(1328, 527, '', 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 240000, 'Chưa gọi', '2025-08-02 06:01:59', '2025-08-02 06:01:59'),
(1330, 527, NULL, 203, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'toa thuốc', '07/08/2025', 0, 'Chưa gọi', '2025-08-07 14:41:24', '2025-08-07 14:41:24'),
(1331, 527, NULL, 203, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'toa thuốc', '07/08/2025', 0, 'Chưa gọi', '2025-08-07 14:41:42', '2025-08-07 14:41:42'),
(1332, 527, '', 203, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 240000, 'Chưa gọi', '2025-08-07 14:41:45', '2025-08-07 14:41:45'),
(1333, 527, '', 203, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 120000, 'Chưa gọi', '2025-08-07 14:41:57', '2025-08-07 14:41:57'),
(1334, 525, NULL, 1, 1, '', 'L2ần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'toa thuốc', '15/08/2025', 50000, 'Chưa gọi', '2025-08-14 14:44:42', '2025-08-14 14:44:42'),
(1335, 525, NULL, 1, 1, '', 'L2ần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'toa thuốc', '15/08/2025', 50000, 'Chưa gọi', '2025-08-14 14:55:07', '2025-08-14 14:55:07'),
(1336, 525, NULL, 1, 1, '', 'L2ần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'toa thuốc', '15/08/2025', 50000, 'Chưa gọi', '2025-08-14 14:55:11', '2025-08-14 14:55:11'),
(1337, 525, NULL, 1, 1, '', 'L2ần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'toa thuốc', '15/08/2025', 50000, 'Chưa gọi', '2025-08-14 14:55:19', '2025-08-14 14:55:19'),
(1338, 525, NULL, 1, 1, '', 'L2ần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'toa thuốc', '21/08/2025', 50000, 'Chưa gọi', '2025-08-20 06:20:49', '2025-08-20 06:20:49'),
(1339, 526, '', 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 120000, 'Chưa gọi', '2025-08-24 12:42:12', '2025-08-24 12:42:12'),
(1343, 526, '', 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 120000, 'Chưa gọi', '2025-08-24 12:52:33', '2025-08-24 12:52:33'),
(1344, 526, '', 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 120000, 'Chưa gọi', '2025-08-24 12:52:36', '2025-08-24 12:52:36'),
(1345, 526, '', 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 360000, 'Chưa gọi', '2025-08-24 13:01:27', '2025-08-24 13:01:27'),
(1346, 526, '', 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 120000, 'Chưa gọi', '2025-08-24 13:02:35', '2025-08-24 13:02:35'),
(1347, 526, '', 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 240000, 'Chưa gọi', '2025-08-24 13:09:08', '2025-08-24 13:09:08'),
(1348, 526, '', 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 240000, 'Chưa gọi', '2025-08-24 13:09:15', '2025-08-24 13:09:15'),
(1349, 526, '', 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 540000, 'Chưa gọi', '2025-08-24 13:10:19', '2025-08-24 13:10:19'),
(1350, 526, '', 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 540000, 'Chưa gọi', '2025-08-24 13:10:32', '2025-08-24 13:10:32'),
(1351, 526, '', 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 240000, 'Chưa gọi', '2025-08-24 13:11:14', '2025-08-24 13:11:14'),
(1352, 526, '', 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 240000, 'Chưa gọi', '2025-08-24 13:11:25', '2025-08-24 13:11:25'),
(1353, 526, '', 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 240000, 'Chưa gọi', '2025-08-24 13:15:33', '2025-08-24 13:15:33'),
(1354, 526, '', 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 240000, 'Chưa gọi', '2025-08-24 13:15:38', '2025-08-24 13:15:38'),
(1355, 526, '', 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 240000, 'Chưa gọi', '2025-08-24 13:15:42', '2025-08-24 13:15:42'),
(1356, 526, '', 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 120000, 'Chưa gọi', '2025-08-24 13:17:19', '2025-08-24 13:17:19'),
(1357, 526, '', 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 240000, 'Chưa gọi', '2025-08-24 13:17:24', '2025-08-24 13:17:24'),
(1358, 526, '', 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 240000, 'Chưa gọi', '2025-08-24 13:18:30', '2025-08-24 13:18:30'),
(1359, 526, '', 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 240000, 'Chưa gọi', '2025-08-24 13:19:14', '2025-08-24 13:19:14'),
(1360, 526, '', 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 580000, 'Chưa gọi', '2025-08-24 13:21:14', '2025-08-24 13:21:14'),
(1361, 526, '', 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 680000, 'Chưa gọi', '2025-08-24 13:21:24', '2025-08-24 13:21:24'),
(1362, 526, '', 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 700000, 'Chưa gọi', '2025-08-24 13:22:33', '2025-08-24 13:22:33'),
(1363, 526, '', 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 700000, 'Chưa gọi', '2025-08-24 13:22:42', '2025-08-24 13:22:42'),
(1364, 526, '', 1, 1, '', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 20000, 'Chưa gọi', '2025-08-24 15:32:30', '2025-08-24 15:32:30'),
(1365, 525, '', 1, 1, '', 'L2ần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 30000, 'Chưa gọi', '2025-08-25 06:47:31', '2025-08-25 06:47:31'),
(1367, 525, '', 1, 1, '', 'L2ần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 240000, 'Chưa gọi', '2025-08-25 07:30:27', '2025-08-25 07:30:27'),
(1368, 525, '', 1, 1, '', 'L2ần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 360000, 'Chưa gọi', '2025-08-25 07:38:48', '2025-08-25 07:38:48'),
(1369, 525, '', 1, 1, '', 'L2ần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 250000, 'Chưa gọi', '2025-08-25 07:39:42', '2025-08-25 07:39:42'),
(1370, 525, NULL, 1, 1, '', 'L2ần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'toa thuốc', '25/08/2025', 0, 'Chưa gọi', '2025-08-25 07:51:46', '2025-08-25 07:51:46'),
(1371, 525, NULL, 1, 1, '', 'L2ần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'toa thuốc', '25/08/2025', 0, 'Chưa gọi', '2025-08-25 08:30:41', '2025-08-25 08:30:41'),
(1372, 525, NULL, 1, 1, '', 'L2ần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'toa thuốc', '26/08/2025', 50000, 'Chưa gọi', '2025-08-25 08:31:20', '2025-08-25 08:31:20'),
(1373, 525, '', 1, 1, '', 'L2ần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 240000, 'Chưa gọi', '2025-08-29 04:34:17', '2025-08-29 04:34:17'),
(1374, 525, '', 1, 1, '', 'L2ần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 480000, 'Chưa gọi', '2025-08-29 04:48:35', '2025-08-29 04:48:35'),
(1375, 525, '', 1, 1, '', 'L2ần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C', 'chỉ định', NULL, 600000, 'Chưa gọi', '2025-08-29 05:09:12', '2025-08-29 05:09:12');

-- --------------------------------------------------------

--
-- Table structure for table `examination_medications`
--

CREATE TABLE `examination_medications` (
  `id` bigint(20) NOT NULL,
  `examination_id` bigint(20) NOT NULL,
  `medication_id` bigint(20) DEFAULT NULL,
  `morning` varchar(20) DEFAULT NULL,
  `noon` varchar(20) DEFAULT NULL,
  `afternoon` varchar(20) DEFAULT NULL,
  `evening` varchar(20) DEFAULT NULL,
  `unit` varchar(15) DEFAULT NULL,
  `days_of_use` int(11) DEFAULT NULL,
  `total_quantity_med` int(11) DEFAULT NULL,
  `note` varchar(100) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `examination_medications`
--

INSERT INTO `examination_medications` (`id`, `examination_id`, `medication_id`, `morning`, `noon`, `afternoon`, `evening`, `unit`, `days_of_use`, `total_quantity_med`, `note`, `created_at`, `updated_at`) VALUES
(1661, 1324, 80, NULL, NULL, NULL, NULL, 'Viên', NULL, NULL, '', '2025-08-02 06:01:00', '2025-08-02 06:01:00'),
(1662, 1324, 65, NULL, NULL, NULL, NULL, 'Viên', NULL, NULL, '', '2025-08-02 06:01:00', '2025-08-02 06:01:00'),
(1667, 1331, 80, NULL, NULL, NULL, NULL, 'Viên', NULL, NULL, '', '2025-08-07 14:41:42', '2025-08-07 14:41:42'),
(1668, 1331, 80, NULL, NULL, NULL, NULL, 'Viên', NULL, NULL, '', '2025-08-07 14:41:42', '2025-08-07 14:41:42'),
(1669, 1331, 65, NULL, NULL, NULL, NULL, 'Viên', NULL, NULL, '', '2025-08-07 14:41:42', '2025-08-07 14:41:42'),
(1670, 1331, 51, NULL, NULL, NULL, NULL, 'Viên', NULL, NULL, '', '2025-08-07 14:41:42', '2025-08-07 14:41:42'),
(1671, 1334, 80, '1', '2', '3', '4', 'Viên', 1, 10, '', '2025-08-14 14:44:42', '2025-08-14 14:44:42'),
(1672, 1335, 80, '1', '2', '3', '4', 'Viên', 1, 10, '', '2025-08-14 14:55:07', '2025-08-14 14:55:07'),
(1673, 1336, 80, '1', '3', '3', '4', 'Viên', 1, 11, '', '2025-08-14 14:55:11', '2025-08-14 14:55:11'),
(1674, 1337, 80, '1', '3', '3', '4', 'Viên', 1, 11, '', '2025-08-14 14:55:19', '2025-08-14 14:55:19'),
(1675, 1338, 80, '1', NULL, NULL, '1', 'Viên', 1, 2, '', '2025-08-20 06:20:49', '2025-08-20 06:20:49'),
(1676, 1370, 80, NULL, NULL, NULL, NULL, 'Viên', NULL, NULL, '', '2025-08-25 07:51:46', '2025-08-25 07:51:46'),
(1677, 1370, 65, NULL, NULL, NULL, NULL, 'Viên', NULL, NULL, '', '2025-08-25 07:51:46', '2025-08-25 07:51:46'),
(1678, 1370, 51, NULL, NULL, NULL, NULL, 'Viên', NULL, NULL, '', '2025-08-25 07:51:46', '2025-08-25 07:51:46'),
(1679, 1370, 32, NULL, NULL, NULL, NULL, 'Viên', NULL, NULL, '', '2025-08-25 07:51:46', '2025-08-25 07:51:46'),
(1680, 1371, 80, NULL, NULL, NULL, NULL, 'Viên', NULL, NULL, '', '2025-08-25 08:30:42', '2025-08-25 08:30:42'),
(1681, 1371, 65, NULL, NULL, NULL, NULL, 'Viên', NULL, NULL, '', '2025-08-25 08:30:42', '2025-08-25 08:30:42'),
(1682, 1371, 51, NULL, NULL, NULL, NULL, 'Viên', NULL, NULL, '', '2025-08-25 08:30:42', '2025-08-25 08:30:42'),
(1683, 1372, 80, '1', '1', '1', '1', 'Viên', 1, 4, '', '2025-08-25 08:31:20', '2025-08-25 08:31:20'),
(1684, 1372, 65, '1', '1', '1', '1', 'Viên', 1, 4, '', '2025-08-25 08:31:20', '2025-08-25 08:31:20'),
(1685, 1372, 51, '1', '1', '1', '1', 'Viên', 1, 4, '', '2025-08-25 08:31:20', '2025-08-25 08:31:20'),
(1686, 1372, 32, '1', '1', '1', '1', 'Viên', 1, 4, '', '2025-08-25 08:31:20', '2025-08-25 08:31:20');

-- --------------------------------------------------------

--
-- Table structure for table `examination_results`
--

CREATE TABLE `examination_results` (
  `id` bigint(20) NOT NULL,
  `examination_service_id` bigint(20) NOT NULL,
  `template_id` bigint(20) DEFAULT NULL,
  `result` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NOT NULL,
  `final_result` varchar(255) DEFAULT NULL,
  `file_path` longtext DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `examination_results`
--

INSERT INTO `examination_results` (`id`, `examination_service_id`, `template_id`, `result`, `final_result`, `file_path`, `created_at`, `updated_at`) VALUES
(1166, 3318, 52, '- Xương hàm dưới: Không ghi nhận hình ảnh bất thường.\r\n\r\n\r\n- Ghi nhận khác: Không.', 'Hiện tại chưa ghi nhận hình ảnh bất thường trên phim Xquang.', NULL, '2025-08-07 14:42:55', '2025-08-07 14:42:55'),
(1167, 3368, 72, '[{\"indication\":\"LEU\",\"result\":null,\"unit\":\"Leu/µL\",\"normal_range\":\"Âm tính\"},{\"indication\":\"NIT\",\"result\":null,\"unit\":null,\"normal_range\":\"Âm tính\"},{\"indication\":\"UBG\",\"result\":null,\"unit\":\"µmol/L\",\"normal_range\":\"<30\"},{\"indication\":\"PRO\",\"result\":null,\"unit\":\"g/L\",\"normal_range\":\"Âm tính\"},{\"indication\":\"PH\",\"result\":null,\"unit\":null,\"normal_range\":\"5.0 - 7.5\"},{\"indication\":\"ERY\",\"result\":null,\"unit\":\"Ery/µL\",\"normal_range\":\"Âm tính\"},{\"indication\":\"SG\",\"result\":null,\"unit\":null,\"normal_range\":\"1.005 - 1.030\"},{\"indication\":\"KET\",\"result\":null,\"unit\":\"mmol/L\",\"normal_range\":\"Âm tính\"},{\"indication\":\"BIL\",\"result\":null,\"unit\":\"µmol/L\",\"normal_range\":\"Âm tính\"},{\"indication\":\"GLU\",\"result\":null,\"unit\":\"mmol/L\",\"normal_range\":\"Âm tính\"}]', '', NULL, '2025-08-25 07:13:22', '2025-08-25 07:13:22'),
(1168, 3369, 45, '- Cấu trúc xương cổ chân + gót chân: Chưa phát hiện tổn thương.\r\n\r\n\r\n\r\n- Cấu trúc các xương bàn chân: Chưa phát hiện tổn thương. \r\n\r\n\r\n\r\n- Cấu trúc xương ngón chân: Chưa phát hiện tổn thương.\r\n\r\n\r\n\r\n- Khe khớp: Trong giới hạn bình thường.\r\n\r\n\r\n\r\n- Xương vừng: Chưa phát hiện tổn thương.', 'Hiện tại chưa ghi nhận bất thường trên phim.', NULL, '2025-08-25 07:30:39', '2025-08-25 07:30:39'),
(1169, 3371, 48, '* Cấu trúc mô mềm: Không phát hiện hình ảnh bất thường trên phim.\r\n\r\n\r\n\r\n* Cấu trúc xương hộp sọ: Không phát hiện hình ảnh bất thường trên phim.\r\n\r\n\r\n\r\n* Các khớp sọ: Trong giới hạn bình thường.\r\n\r\n\r\n\r\n* Ghi nhận khác: Không có.', 'Hiện tại chưa ghi nhận bất thường trên phim.', NULL, '2025-08-25 07:40:54', '2025-08-25 07:40:54'),
(1170, 3377, 48, '* Cấu trúc mô mềm: Không phát hiện hình ảnh bất thường trên phim.\r\n\r\n\r\n\r\n* Cấu trúc xương hộp sọ: Không phát hiện hình ảnh bất thường trên phim.\r\n\r\n\r\n\r\n* Các khớp sọ: Trong giới hạn bình thường.\r\n\r\n\r\n\r\n* Ghi nhận khác: Không có.', 'Hiện tại chưa ghi nhận bất thường trên phim.', NULL, '2025-08-29 04:34:31', '2025-08-29 04:34:31');

-- --------------------------------------------------------

--
-- Table structure for table `examination_services`
--

CREATE TABLE `examination_services` (
  `id` bigint(20) NOT NULL,
  `examination_id` bigint(20) NOT NULL,
  `service_id` bigint(20) NOT NULL,
  `price` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `examination_services`
--

INSERT INTO `examination_services` (`id`, `examination_id`, `service_id`, `price`, `created_at`, `updated_at`) VALUES
(3314, 1327, 28, 120000, '2025-08-02 06:01:51', '2025-08-02 06:01:51'),
(3315, 1327, 29, 120000, '2025-08-02 06:01:51', '2025-08-02 06:01:51'),
(3316, 1328, 28, 120000, '2025-08-02 06:01:59', '2025-08-02 06:01:59'),
(3317, 1328, 29, 120000, '2025-08-02 06:01:59', '2025-08-02 06:01:59'),
(3318, 1332, 28, 120000, '2025-08-07 14:41:45', '2025-08-07 14:41:45'),
(3319, 1332, 29, 120000, '2025-08-07 14:41:45', '2025-08-07 14:41:45'),
(3320, 1333, 28, 120000, '2025-08-07 14:41:57', '2025-08-07 14:41:57'),
(3322, 1343, 28, 120000, '2025-08-24 12:52:33', '2025-08-24 12:52:33'),
(3323, 1344, 28, 120000, '2025-08-24 12:52:36', '2025-08-24 12:52:36'),
(3325, 1346, 28, 120000, '2025-08-24 13:02:37', '2025-08-24 13:02:37'),
(3326, 1347, 28, 120000, '2025-08-24 13:09:08', '2025-08-24 13:09:08'),
(3327, 1347, 29, 120000, '2025-08-24 13:09:08', '2025-08-24 13:09:08'),
(3328, 1348, 28, 120000, '2025-08-24 13:09:15', '2025-08-24 13:09:15'),
(3329, 1348, 29, 120000, '2025-08-24 13:09:15', '2025-08-24 13:09:15'),
(3332, 1351, 28, 120000, '2025-08-24 13:11:16', '2025-08-24 13:11:16'),
(3333, 1351, 29, 120000, '2025-08-24 13:11:16', '2025-08-24 13:11:16'),
(3335, 1353, 28, 120000, '2025-08-24 13:15:33', '2025-08-24 13:15:33'),
(3336, 1353, 29, 120000, '2025-08-24 13:15:33', '2025-08-24 13:15:33'),
(3339, 1356, 28, 120000, '2025-08-24 13:17:19', '2025-08-24 13:17:19'),
(3342, 1359, 28, 120000, '2025-08-24 13:19:17', '2025-08-24 13:19:17'),
(3343, 1359, 29, 120000, '2025-08-24 13:19:18', '2025-08-24 13:19:18'),
(3344, 1360, 28, 120000, '2025-08-24 13:21:14', '2025-08-24 13:21:14'),
(3345, 1360, 29, 120000, '2025-08-24 13:21:14', '2025-08-24 13:21:14'),
(3346, 1360, 51, 120000, '2025-08-24 13:21:14', '2025-08-24 13:21:14'),
(3347, 1360, 79, 120000, '2025-08-24 13:21:14', '2025-08-24 13:21:14'),
(3348, 1360, 15, 100000, '2025-08-24 13:21:14', '2025-08-24 13:21:14'),
(3349, 1361, 28, 120000, '2025-08-24 13:21:24', '2025-08-24 13:21:24'),
(3350, 1361, 29, 120000, '2025-08-24 13:21:24', '2025-08-24 13:21:24'),
(3351, 1361, 51, 120000, '2025-08-24 13:21:24', '2025-08-24 13:21:24'),
(3352, 1361, 79, 120000, '2025-08-24 13:21:24', '2025-08-24 13:21:24'),
(3353, 1361, 15, 100000, '2025-08-24 13:21:24', '2025-08-24 13:21:24'),
(3354, 1361, 16, 100000, '2025-08-24 13:21:24', '2025-08-24 13:21:24'),
(3355, 1362, 28, 120000, '2025-08-24 13:22:33', '2025-08-24 13:22:33'),
(3356, 1362, 29, 120000, '2025-08-24 13:22:33', '2025-08-24 13:22:33'),
(3357, 1362, 51, 120000, '2025-08-24 13:22:33', '2025-08-24 13:22:33'),
(3358, 1362, 79, 120000, '2025-08-24 13:22:33', '2025-08-24 13:22:33'),
(3359, 1362, 15, 100000, '2025-08-24 13:22:33', '2025-08-24 13:22:33'),
(3360, 1362, 35, 120000, '2025-08-24 13:22:33', '2025-08-24 13:22:33'),
(3361, 1363, 28, 120000, '2025-08-24 13:22:42', '2025-08-24 13:22:42'),
(3362, 1363, 29, 120000, '2025-08-24 13:22:42', '2025-08-24 13:22:42'),
(3363, 1363, 51, 120000, '2025-08-24 13:22:42', '2025-08-24 13:22:42'),
(3364, 1363, 79, 120000, '2025-08-24 13:22:42', '2025-08-24 13:22:42'),
(3365, 1363, 15, 100000, '2025-08-24 13:22:42', '2025-08-24 13:22:42'),
(3366, 1363, 35, 120000, '2025-08-24 13:22:42', '2025-08-24 13:22:42'),
(3367, 1364, 61, 20000, '2025-08-24 15:32:30', '2025-08-24 15:32:30'),
(3368, 1365, 64, 30000, '2025-08-25 06:47:31', '2025-08-25 06:47:31'),
(3369, 1367, 28, 120000, '2025-08-25 07:30:27', '2025-08-25 07:30:27'),
(3370, 1367, 29, 120000, '2025-08-25 07:30:27', '2025-08-25 07:30:27'),
(3371, 1368, 28, 120000, '2025-08-25 07:38:48', '2025-08-25 07:38:48'),
(3372, 1368, 29, 120000, '2025-08-25 07:38:48', '2025-08-25 07:38:48'),
(3373, 1368, 30, 120000, '2025-08-25 07:38:48', '2025-08-25 07:38:48'),
(3374, 1369, 18, 100000, '2025-08-25 07:39:42', '2025-08-25 07:39:42'),
(3375, 1369, 60, 30000, '2025-08-25 07:39:42', '2025-08-25 07:39:42'),
(3376, 1369, 46, 120000, '2025-08-25 07:39:42', '2025-08-25 07:39:42'),
(3377, 1373, 28, 120000, '2025-08-29 04:34:17', '2025-08-29 04:34:17'),
(3378, 1373, 29, 120000, '2025-08-29 04:34:17', '2025-08-29 04:34:17'),
(3379, 1374, 28, 120000, '2025-08-29 04:48:35', '2025-08-29 04:48:35'),
(3380, 1374, 29, 120000, '2025-08-29 04:48:35', '2025-08-29 04:48:35'),
(3381, 1374, 31, 120000, '2025-08-29 04:48:35', '2025-08-29 04:48:35'),
(3382, 1374, 29, 120000, '2025-08-29 04:48:35', '2025-08-29 04:48:35'),
(3383, 1375, 28, 120000, '2025-08-29 05:09:12', '2025-08-29 05:09:12'),
(3384, 1375, 29, 120000, '2025-08-29 05:09:12', '2025-08-29 05:09:12'),
(3385, 1375, 30, 120000, '2025-08-29 05:09:12', '2025-08-29 05:09:12'),
(3386, 1375, 31, 120000, '2025-08-29 05:09:12', '2025-08-29 05:09:12'),
(3387, 1375, 32, 120000, '2025-08-29 05:09:12', '2025-08-29 05:09:12');

-- --------------------------------------------------------

--
-- Table structure for table `medications`
--

CREATE TABLE `medications` (
  `id` bigint(20) NOT NULL,
  `name` varchar(255) NOT NULL,
  `unit` varchar(50) DEFAULT NULL,
  `note` text DEFAULT NULL,
  `price` int(11) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `medications`
--

INSERT INTO `medications` (`id`, `name`, `unit`, `note`, `price`, `created_at`, `updated_at`) VALUES
(17, 'Amoxicilin 500mg', 'viên', '', 15000, '2025-06-10 23:21:22', '2025-06-10 23:32:14'),
(18, 'Klamentin 625mg', 'Gói', '', 15000, '2025-06-10 23:29:25', '2025-06-10 23:32:03'),
(19, 'Claminat 625mg', 'Viên', '', 15000, '2025-06-10 23:31:49', '2025-06-10 23:31:49'),
(20, 'Ciprofloxacin 500mg', 'Viên', '', 15000, '2025-06-10 23:33:02', '2025-06-10 23:33:02'),
(21, 'Cefpodoxim 100mg', 'Viên', '', 20000, '2025-06-10 23:33:53', '2025-06-10 23:33:53'),
(22, 'Erythromycin 250mg', 'Gói', '', 10000, '2025-06-10 23:34:49', '2025-06-10 23:34:49'),
(23, 'Clarithromycin 500mg', 'Viên', '', 20000, '2025-06-10 23:35:30', '2025-06-10 23:35:30'),
(24, 'Hapacol 650mg', 'Viên', '', 10000, '2025-06-10 23:36:13', '2025-06-10 23:40:53'),
(25, 'Hapacol 325', 'Viên', '', 10000, '2025-06-10 23:36:47', '2025-06-10 23:41:00'),
(26, 'Flunarizin 5mg', 'Viên', '', 10000, '2025-06-10 23:37:31', '2025-06-10 23:41:05'),
(27, 'Magnesi B6', 'Viên', '', 10000, '2025-06-10 23:38:03', '2025-06-10 23:41:11'),
(28, 'Cà gai leo', 'Viên', '', 10000, '2025-06-10 23:38:42', '2025-06-10 23:41:17'),
(29, 'Omeprazol 20mg', 'Viên', '', 10000, '2025-06-10 23:39:12', '2025-06-10 23:41:22'),
(30, 'Eperison 50', 'Viên', '', 10000, '2025-06-10 23:40:00', '2025-06-10 23:41:28'),
(31, 'Celecoxib', 'Viên', '', 10000, '2025-06-10 23:40:27', '2025-06-10 23:41:33'),
(32, 'Alverine 60mg', 'Viên', '', 10000, '2025-06-10 23:42:09', '2025-06-10 23:42:09'),
(33, 'Domperidon 10mg', 'Viên', '', 10000, '2025-06-10 23:42:38', '2025-06-10 23:42:38'),
(34, 'Prednisolone 5mg', 'Viên', '', 10000, '2025-06-10 23:43:06', '2025-06-10 23:43:06'),
(35, 'Clopheniramin 4mg', 'Viên', '', 10000, '2025-06-10 23:43:35', '2025-06-10 23:43:35'),
(36, 'Cetirizine 10mg', 'Viên', '', 10000, '2025-06-10 23:44:15', '2025-06-10 23:44:15'),
(37, 'Cedetamin', 'Viên', '', 10000, '2025-06-10 23:44:47', '2025-06-10 23:44:47'),
(38, 'Piracetam 800mg', 'Viên', '', 10000, '2025-06-10 23:45:20', '2025-06-10 23:45:20'),
(39, 'Olanzapine 5mg', 'Viên', '', 10000, '2025-06-10 23:45:53', '2025-06-10 23:45:53'),
(40, 'Probio', 'gói', '', 10000, '2025-06-10 23:46:22', '2025-06-10 23:46:22'),
(41, 'Sorbitol', 'Gói', '', 10000, '2025-06-10 23:46:47', '2025-06-10 23:46:47'),
(42, 'Suliride 50mg', 'Viên', '', 10000, '2025-06-10 23:55:16', '2025-06-10 23:55:16'),
(43, 'Amlodipin 5mg', 'Viên', '', 5000, '2025-06-10 23:55:48', '2025-06-10 23:55:48'),
(44, 'Rotundin', 'Viên', '', 10000, '2025-06-10 23:56:17', '2025-06-10 23:56:17'),
(45, 'Metformin 500mg', 'Viên', '', 5000, '2025-06-10 23:57:03', '2025-06-10 23:57:03'),
(46, 'Terpin - cod', 'Viên', '', 5000, '2025-06-10 23:57:38', '2025-06-10 23:57:38'),
(47, 'Trimetazidine 35mg', 'Viên', '', 5000, '2025-06-11 04:27:21', '2025-06-11 04:27:21'),
(48, 'Losartan 25mg', 'Viên', '', 5000, '2025-06-11 04:28:02', '2025-06-11 04:28:02'),
(49, 'Mitux E 100mg Acetylcysteine', 'Gói', '', 10000, '2025-06-11 04:29:00', '2025-06-11 04:29:00'),
(50, 'Ginko', 'Viên', '', 5000, '2025-06-11 04:29:30', '2025-06-11 04:29:30'),
(51, 'Alphachoay', 'Viên', '', 5000, '2025-06-11 04:29:55', '2025-06-11 04:29:55'),
(52, 'Aspirin 81mg', 'Viên', '', 5000, '2025-06-11 04:30:40', '2025-06-11 04:30:40'),
(53, 'Terpinzoat', 'Viên', '', 10000, '2025-06-11 04:31:23', '2025-06-11 04:31:23'),
(54, 'Eugica', 'Viên', '', 10000, '2025-06-11 04:32:15', '2025-06-11 04:32:15'),
(55, 'Phosphalugel', 'Gói', '', 10000, '2025-06-11 04:32:54', '2025-06-11 04:32:54'),
(56, 'Sulpiride 50mg', 'Viên', '', 10000, '2025-06-11 04:35:14', '2025-06-11 04:35:14'),
(57, 'Glisan - Gliclazid 30mg', 'viên', 'Uống trước ăn 30 phút', 5000, '2025-06-11 04:36:23', '2025-06-11 04:36:23'),
(58, 'Gliclazide 60mg', 'Viên', '', 5000, '2025-06-11 04:37:11', '2025-06-11 04:37:11'),
(59, 'Metformin 850mg', 'Viên', '', 5000, '2025-06-11 04:38:31', '2025-06-11 04:38:31'),
(60, 'Losartan 50mg', 'Viên', '', 5000, '2025-06-11 04:39:04', '2025-06-11 04:39:04'),
(61, 'Vitamin 3B', 'Viên', '', 5000, '2025-06-11 04:53:54', '2025-06-11 04:53:54'),
(62, 'Methyprednisolone 16mg', 'Viên', '', 10000, '2025-06-16 11:26:23', '2025-06-16 11:26:23'),
(63, 'Methy 4mg', 'Viên', '', 10000, '2025-06-16 11:26:43', '2025-06-16 11:26:43'),
(64, 'Atorvastatin 20mg', 'Viên', '', 5000, '2025-06-17 05:39:01', '2025-06-17 05:39:01'),
(65, 'albendazole 400mg', 'Viên', '', 10000, '2025-06-17 05:44:31', '2025-06-17 05:44:31'),
(66, 'Angut 300 (Allopurinol300mg)', 'Viên', '', 10000, '2025-06-17 12:58:17', '2025-06-17 12:58:17'),
(67, 'Biolac (probiotic)', 'Viên', '', 10000, '2025-06-17 13:13:43', '2025-06-17 13:13:43'),
(68, 'Lanso 30mg', 'Viên', '', 10000, '2025-06-17 13:14:52', '2025-06-17 13:14:52'),
(69, 'Bisoprolone 2,5mg', 'Viên', '', 10000, '2025-06-21 04:04:53', '2025-06-21 04:04:53'),
(70, 'Vitamin C', 'Viên', '', 10000, '2025-06-21 04:05:14', '2025-06-21 04:05:14'),
(71, 'Fenofibrat 200mg', 'Viên', '', 10000, '2025-06-21 04:06:12', '2025-06-21 04:06:12'),
(72, 'Cedetamin', 'Viên', '', 10000, '2025-06-25 04:10:52', '2025-06-25 04:10:52'),
(73, 'Lanso 30mg', 'Viên', '', 10000, '2025-07-03 04:39:31', '2025-07-03 04:39:31'),
(74, 'Meloxicam 15mg', 'Viên', '', 10000, '2025-07-05 03:53:10', '2025-07-05 03:53:10'),
(75, 'Methocarbamol 500mg', 'Viên', '', 10000, '2025-07-05 05:04:02', '2025-07-05 05:04:02'),
(76, 'Gan Thiên An', 'hôp', '', 250000, '2025-07-09 13:37:32', '2025-07-09 13:37:32'),
(77, 'Meloxicam', 'viên', '', 50000, '2025-07-12 05:19:32', '2025-07-12 05:19:32'),
(78, 'Bromhexin 8mg', 'Viên', '', 50000, '2025-07-18 11:28:55', '2025-07-18 11:28:55'),
(79, 'Xisat', 'Chai', '', NULL, '2025-07-27 02:57:58', '2025-07-27 02:57:58'),
(80, 'Acylovir 800mg', 'Viên', '', NULL, '2025-07-27 03:20:24', '2025-07-27 03:20:24');

-- --------------------------------------------------------

--
-- Table structure for table `patients`
--

CREATE TABLE `patients` (
  `id` bigint(20) NOT NULL,
  `name` varchar(255) NOT NULL,
  `date_of_birth` date DEFAULT NULL,
  `gender` enum('Nam','Nữ','Khác') DEFAULT NULL,
  `phone` varchar(20) DEFAULT NULL,
  `address` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `pulse` varchar(40) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `blood_pressure` varchar(40) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `respiratory_rate` varchar(40) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `weight` varchar(40) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `height` varchar(40) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `temperature` varchar(40) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `patients`
--

INSERT INTO `patients` (`id`, `name`, `date_of_birth`, `gender`, `phone`, `address`, `created_at`, `updated_at`, `pulse`, `blood_pressure`, `respiratory_rate`, `weight`, `height`, `temperature`) VALUES
(525, 'C', '2025-07-31', 'Nam', '', '', '2025-07-31 14:38:10', '2025-08-29 04:10:48', 'L2ần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C'),
(526, 'fdfs', '2025-07-31', 'Nam', '', '', '2025-07-31 14:56:05', '2025-08-24 11:20:42', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C'),
(527, 'oioi', '2025-07-31', 'Nam', '', '', '2025-07-31 15:14:51', '2025-08-07 14:38:34', 'Lần / phút', 'mmHg', 'Lần/phút', 'kg', 'cm', '°C');

-- --------------------------------------------------------

--
-- Table structure for table `services`
--

CREATE TABLE `services` (
  `id` bigint(20) NOT NULL,
  `name` varchar(255) NOT NULL,
  `type` enum('X-quang','Điện tim','Xét nghiệm','Siêu âm') NOT NULL,
  `content` mediumtext DEFAULT NULL,
  `price` int(11) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `services`
--

INSERT INTO `services` (`id`, `name`, `type`, `content`, `price`, `created_at`, `updated_at`) VALUES
(15, 'Siêu âm tuyến vú', 'Siêu âm', NULL, 100000, '2025-05-18 14:23:13', '2025-06-04 14:29:25'),
(16, 'Siêu âm thai quý 1', 'Siêu âm', NULL, 100000, '2025-05-18 14:23:13', '2025-05-18 14:23:13'),
(17, 'Siêu âm thai quý 2', 'Siêu âm', NULL, 100000, '2025-05-18 14:23:13', '2025-05-18 14:23:13'),
(18, 'Siêu âm thai quý 3', 'Siêu âm', NULL, 100000, '2025-05-18 14:23:13', '2025-05-18 14:23:13'),
(19, 'Siêu âm tuyến giáp', 'Siêu âm', NULL, 100000, '2025-05-18 14:23:13', '2025-05-18 14:23:13'),
(20, 'Siêu âm tổng quát nam', 'Siêu âm', NULL, 100000, '2025-05-18 14:23:13', '2025-05-18 14:23:13'),
(21, 'Siêu âm tổng quát nữ', 'Siêu âm', NULL, 100000, '2025-05-18 14:23:13', '2025-05-18 14:23:13'),
(22, 'Siêu âm tổng quát nữ - mãn kinh', 'Siêu âm', NULL, 100000, '2025-05-18 14:23:13', '2025-05-18 14:23:13'),
(23, 'Siêu âm tử cung phần phụ', 'Siêu âm', NULL, 100000, '2025-05-18 14:23:13', '2025-05-18 14:23:13'),
(24, 'Siêu âm mô mềm, khớp', 'Siêu âm', NULL, 100000, '2025-05-18 14:23:13', '2025-06-04 14:33:54'),
(25, 'Siêu âm tĩnh mạch chi dưới', 'Siêu âm', NULL, 150000, '2025-05-18 14:23:13', '2025-05-18 14:24:34'),
(26, 'Siêu âm động mạch cảnh', 'Siêu âm', NULL, 150000, '2025-05-18 14:23:13', '2025-05-18 14:24:43'),
(27, 'Siêu âm doppler tim', 'Siêu âm', NULL, 150000, '2025-05-18 14:23:13', '2025-05-18 14:24:22'),
(28, 'X-Quang ngực thẳng', 'X-quang', NULL, 120000, '2025-05-18 14:23:13', '2025-06-04 14:16:24'),
(29, 'X-Quang cột sống cổ chếch ¾ trái, phải', 'X-quang', NULL, 120000, '2025-05-18 14:23:13', '2025-06-04 14:17:10'),
(30, 'X-Quang cột sống cổ thẳng nghiêng', 'X-quang', NULL, 120000, '2025-05-18 14:23:13', '2025-06-04 14:22:42'),
(31, 'X-Quang cột sống thắt lưng thẳng nghiêng', 'X-quang', NULL, 120000, '2025-05-18 14:23:13', '2025-06-04 14:23:29'),
(32, 'X-Quang vai', 'X-quang', NULL, 120000, '2025-05-18 14:23:13', '2025-06-04 14:23:43'),
(33, 'X-Quang cánh tay', 'X-quang', NULL, 120000, '2025-05-18 14:23:13', '2025-06-04 14:23:55'),
(34, 'X-Quang khuỷu tay', 'X-quang', NULL, 120000, '2025-05-18 14:23:13', '2025-06-04 14:19:02'),
(35, 'X-Quang xương cẳng tay', 'X-quang', NULL, 120000, '2025-05-18 14:23:13', '2025-06-04 14:27:43'),
(36, 'X-Quang xương cổ tay', 'X-quang', NULL, 120000, '2025-05-18 14:23:13', '2025-06-04 14:28:02'),
(37, 'X-Quang xương bàn tay', 'X-quang', NULL, 120000, '2025-05-18 14:23:13', '2025-06-04 14:28:22'),
(38, 'X-Quang khung chậu', 'X-quang', NULL, 120000, '2025-05-18 14:23:13', '2025-06-04 14:20:50'),
(39, 'X-Quang xương đùi', 'X-quang', NULL, 120000, '2025-05-18 14:23:13', '2025-06-04 14:25:03'),
(40, 'X-Quang xương khớp gối', 'X-quang', NULL, 120000, '2025-05-18 14:23:13', '2025-06-04 14:21:18'),
(41, 'X-Quang cẳng chân', 'X-quang', NULL, 120000, '2025-05-18 14:23:13', '2025-06-04 14:25:11'),
(42, 'X-Quang cổ chân', 'X-quang', NULL, 120000, '2025-05-18 14:23:13', '2025-06-04 14:22:51'),
(43, 'X-Quang bàn chân', 'X-quang', NULL, 120000, '2025-05-18 14:23:13', '2025-06-04 14:22:59'),
(44, 'X-Quang xương gót', 'X-quang', NULL, 120000, '2025-05-18 14:23:13', '2025-06-04 14:23:05'),
(45, 'X-Quang bụng đứng không chuẩn bị', 'X-quang', NULL, 120000, '2025-05-18 14:23:13', '2025-06-04 14:23:14'),
(46, 'X-Quang sọ, mặt thẳng nghiêng', 'X-quang', NULL, 120000, '2025-05-18 14:23:13', '2025-06-04 14:25:23'),
(47, 'X-quang Blondeau Hirtz', 'X-quang', NULL, 120000, '2025-05-18 14:23:13', '2025-06-04 14:16:09'),
(48, 'X-Quang Hitz', 'X-quang', NULL, 120000, '2025-05-18 14:23:13', '2025-06-04 14:26:19'),
(49, 'X-Quang xương mũi nghiêng', 'X-quang', NULL, 120000, '2025-05-18 14:23:13', '2025-06-04 14:26:32'),
(50, 'X-Quang xương hàm chếch nghiêng', 'X-quang', NULL, 120000, '2025-05-18 14:23:13', '2025-06-04 14:26:40'),
(51, 'Hệ niệu không chuẩn bị (KUB)', 'X-quang', NULL, 120000, '2025-05-18 14:23:13', '2025-05-18 14:23:13'),
(59, 'Test HbA1C', 'Xét nghiệm', NULL, 120000, '2025-05-31 08:18:34', '2025-06-04 14:35:51'),
(60, 'Định lượng Glucose', 'Xét nghiệm', NULL, 30000, '2025-05-31 08:20:08', '2025-06-16 11:37:18'),
(61, 'Đường máu mao mạch', 'Xét nghiệm', NULL, 20000, '2025-05-31 08:20:38', '2025-05-31 08:20:38'),
(62, 'Ure máu', 'Xét nghiệm', NULL, 30000, '2025-05-31 08:21:09', '2025-05-31 08:21:09'),
(63, 'Creatinin máu', 'Xét nghiệm', NULL, 30000, '2025-05-31 08:21:20', '2025-05-31 08:21:20'),
(64, 'Xét nghiệm GOUT (Acid Uric)', 'Xét nghiệm', NULL, 30000, '2025-05-31 08:21:50', '2025-06-04 14:38:18'),
(65, 'Xét nghiệm nước tiểu', 'Xét nghiệm', NULL, 50000, '2025-05-31 08:22:08', '2025-06-04 14:40:20'),
(66, 'Test nhanh Sốt xuất huyết NS1Ag', 'Xét nghiệm', NULL, 120000, '2025-05-31 08:22:31', '2025-05-31 08:22:31'),
(72, 'ABO, Rh', 'Xét nghiệm', NULL, 60000, '2025-05-31 08:24:41', '2025-05-31 08:24:41'),
(73, 'Test nhanh viêm gan B', 'Xét nghiệm', NULL, 70000, '2025-05-31 08:25:06', '2025-06-04 14:39:18'),
(74, 'Test nhanh viêm gan C', 'Xét nghiệm', NULL, 70000, '2025-05-31 08:25:18', '2025-06-04 14:39:34'),
(75, 'Test H.Pylori', 'Xét nghiệm', NULL, 120000, '2025-05-31 08:25:34', '2025-06-04 14:38:40'),
(76, 'Kháng thể Viêm gan B - Anti HBs', 'Xét nghiệm', NULL, 80000, '2025-05-31 08:26:02', '2025-05-31 08:26:02'),
(77, 'Khám bệnh', 'Xét nghiệm', NULL, 50000, '2025-05-31 08:28:30', '2025-05-31 08:28:30'),
(78, 'Đo điện tim', 'Điện tim', NULL, 50000, '2025-05-31 08:29:05', '2025-05-31 08:29:05'),
(79, 'X-Quang khớp vai', 'X-quang', NULL, 120000, '2025-06-04 14:18:22', '2025-06-04 14:18:22'),
(80, 'X-Quang xương cánh tay', 'X-quang', NULL, 120000, '2025-06-04 14:18:41', '2025-06-04 14:18:41'),
(81, 'Siêu âm tim', 'Siêu âm', NULL, 150000, '2025-06-04 14:30:04', '2025-06-04 14:30:04'),
(82, 'Siêu âm bụng tổng quát', 'Siêu âm', NULL, 100000, '2025-06-04 14:30:32', '2025-06-04 14:30:32'),
(83, 'Siêu âm động tĩnh mạch chi dưới', 'Siêu âm', NULL, 150000, '2025-06-04 14:31:27', '2025-06-04 14:31:27'),
(84, 'Siêu âm thai', 'Siêu âm', NULL, 150000, '2025-06-04 14:32:29', '2025-06-04 14:32:29'),
(85, 'Xét nghiệm huyết học', 'Xét nghiệm', NULL, 80000, '2025-06-04 14:35:15', '2025-06-04 14:35:15'),
(86, 'Xét nghiệm định nhóm máu hệ ABO, Rh (D)', 'Xét nghiệm', NULL, 60000, '2025-06-04 14:35:38', '2025-06-04 14:35:38'),
(87, 'Xét nghiệm men gan (ALT, AST, GGT)', 'Xét nghiệm', NULL, 90000, '2025-06-04 14:37:00', '2025-06-04 14:37:00'),
(88, 'Xét nghiệm chức năng thận (Urê, Creatinin, Độ lọc cầu thận eGFR)', 'Xét nghiệm', NULL, 90000, '2025-06-04 14:37:16', '2025-06-04 14:37:16'),
(89, 'Xét nghiệm mỡ máu (Cholesterol, Triglyceride, HDL-C, LDL-C)', 'Xét nghiệm', NULL, 120000, '2025-06-04 14:37:48', '2025-06-04 14:37:48'),
(90, 'Test nhanh chẩn đoán sốt xuất huyết', 'Xét nghiệm', NULL, 120000, '2025-06-04 14:40:01', '2025-06-04 14:40:01'),
(92, 'Bilirubin TP', 'Xét nghiệm', NULL, 80000, '2025-06-16 11:33:02', '2025-06-16 11:33:02'),
(93, 'Bilirubin Direct', 'Xét nghiệm', NULL, 80000, '2025-06-16 11:35:36', '2025-06-16 11:35:36'),
(94, 'Albumin', 'Xét nghiệm', NULL, 80000, '2025-06-16 11:36:36', '2025-06-16 11:36:36'),
(95, 'Cortisol  máu (Gửi mẫu)', 'Xét nghiệm', NULL, 200000, '2025-06-16 12:16:24', '2025-06-16 12:16:24'),
(96, 'Toxocara canis IgG (Giun đũa chó,mèo)', 'Xét nghiệm', NULL, 200000, '2025-06-16 12:17:54', '2025-06-16 12:17:54'),
(97, 'Stronggyloides-IgG (Giun lươn)', 'Xét nghiệm', NULL, 200000, '2025-06-16 12:18:51', '2025-06-16 12:18:51'),
(98, 'Echinococcus IgG (Sán dãi chó)', 'Xét nghiệm', NULL, 200000, '2025-06-16 12:20:15', '2025-06-16 12:20:15'),
(99, 'Cysticercose IgG (Ấu trùng sán dãi heo)', 'Xét nghiệm', NULL, 200000, '2025-06-16 12:21:02', '2025-06-16 12:21:02'),
(101, 'NIPT Trisure first (Down-Edwards-Patau)', 'Xét nghiệm', NULL, 2000000, '2025-06-16 12:23:33', '2025-06-16 12:23:33'),
(102, 'NIPT Trisure 3 (Trisure first + Turner XO)', 'Xét nghiệm', NULL, 2700000, '2025-06-16 12:26:26', '2025-06-16 12:26:26'),
(103, 'NIPT Trisure 9.5 (Trisure 3 + XXX + XXY)', 'Xét nghiệm', NULL, 4000000, '2025-06-16 12:27:33', '2025-06-16 12:27:33'),
(104, 'NIPT Trisure (full NST)', 'Xét nghiệm', NULL, 5500000, '2025-06-16 12:28:21', '2025-06-16 12:28:21'),
(105, 'CRP (Gửi mẫu)', 'Xét nghiệm', NULL, 200000, '2025-06-16 12:28:53', '2025-06-16 12:28:53'),
(106, 'T3', 'Xét nghiệm', NULL, 150000, '2025-06-16 12:29:29', '2025-06-16 12:29:29'),
(107, 'Free T3', 'Xét nghiệm', NULL, 150000, '2025-06-16 12:29:58', '2025-06-16 12:29:58'),
(108, 'Free T4', 'Xét nghiệm', NULL, 150000, '2025-06-16 12:30:45', '2025-06-16 12:30:45'),
(109, 'T4', 'Xét nghiệm', NULL, 150000, '2025-06-16 12:30:57', '2025-06-16 12:30:57'),
(110, 'TSH', 'Xét nghiệm', NULL, 150000, '2025-06-16 12:31:11', '2025-06-16 12:31:11'),
(111, 'TSH Receptor Ab (TRAb) Basedow', 'Xét nghiệm', NULL, 700000, '2025-06-16 12:32:31', '2025-06-16 12:32:31'),
(112, 'Calcitonin (K giáp)', 'Xét nghiệm', NULL, 250000, '2025-06-16 12:33:48', '2025-06-16 12:35:13'),
(113, 'AFP', 'Xét nghiệm', NULL, 200000, '2025-06-16 12:34:09', '2025-06-16 12:34:09'),
(114, 'PSA total (K TLT)', 'Xét nghiệm', NULL, 250000, '2025-06-16 12:34:54', '2025-06-16 12:34:54'),
(115, 'CEA (K đại tràng)', 'Xét nghiệm', NULL, 250000, '2025-06-16 12:35:50', '2025-06-16 12:35:50'),
(116, 'CA125 (K buồng trứng)', 'Xét nghiệm', NULL, 250000, '2025-06-16 12:36:09', '2025-06-16 12:36:09'),
(117, 'CA15-3 (K vú)', 'Xét nghiệm', NULL, 250000, '2025-06-16 12:36:37', '2025-06-16 12:36:37'),
(118, 'CYFRA 21-1 (K Phổi)', 'Xét nghiệm', NULL, 250000, '2025-06-16 12:37:06', '2025-06-16 12:37:06'),
(119, 'Fe (Sắt huyết thanh) Gửi mẫu.', 'Xét nghiệm', NULL, 100000, '2025-06-19 05:01:28', '2025-06-19 05:01:28'),
(120, 'Ferritin', 'Xét nghiệm', NULL, 200000, '2025-06-19 05:04:45', '2025-06-19 05:04:45'),
(121, 'Ion đồ (Na, K, Ca, Cl)', 'Xét nghiệm', NULL, 200000, '2025-06-19 05:06:42', '2025-06-19 05:06:42'),
(122, 'Calci toàn phần', 'Xét nghiệm', NULL, 60000, '2025-06-19 05:07:08', '2025-06-19 05:07:08'),
(123, 'HBV - DNA Realtime (Định lượng)', 'Xét nghiệm', NULL, 600000, '2025-06-19 05:10:44', '2025-06-19 05:10:44'),
(124, 'HBV - DNA (Cobas Taqman)', 'Xét nghiệm', NULL, 1600000, '2025-06-19 05:12:21', '2025-06-19 05:12:21'),
(125, 'HCV - RNA Realtime (Định lượng)', 'Xét nghiệm', NULL, 800000, '2025-06-19 05:15:47', '2025-06-19 05:15:47'),
(126, 'HCV - RNA (Cobas Taqman)', 'Xét nghiệm', NULL, 1700000, '2025-06-19 05:16:14', '2025-06-19 05:16:14'),
(127, 'Kiểm tra', 'Xét nghiệm', NULL, 0, '2025-06-20 05:04:04', '2025-06-20 05:04:04'),
(128, 'X- Quang cột sống ngực thẳng - nghiêng', 'X-quang', NULL, 120000, '2025-07-01 05:47:41', '2025-07-01 05:47:41'),
(129, 'HBsAg Định lượng  (Roche)', 'Xét nghiệm', NULL, 450000, '2025-07-05 02:00:20', '2025-07-05 02:00:20'),
(131, 'HBV DNA Realtime (định lượng)', 'Xét nghiệm', NULL, 500000, '2025-07-05 02:02:01', '2025-07-05 02:02:01'),
(132, 'TS-TC', 'Xét nghiệm', NULL, 50000, '2025-07-27 01:12:17', '2025-07-27 01:13:52');

-- --------------------------------------------------------

--
-- Table structure for table `templates`
--

CREATE TABLE `templates` (
  `id` bigint(20) NOT NULL,
  `name` varchar(255) NOT NULL,
  `type` varchar(25) NOT NULL,
  `template_content` longtext NOT NULL,
  `result_content` varchar(200) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `templates`
--

INSERT INTO `templates` (`id`, `name`, `type`, `template_content`, `result_content`, `created_at`, `updated_at`) VALUES
(30, 'XQUANG NGỰC THẲNG', 'X-quang', '* Thành ngực:\r\n       - Mô mềm: Chưa ghi nhận hình ảnh bất thường.\r\n       - Xương: Chưa ghi nhận hình ảnh bất thường. \r\n\r\n* Phổi hai bên:\r\n      - Cơ hoành, màng phổi hai bên: Trong giới hạn bình thường.\r\n      - Phế trường phổi: Không ghi nhận tổn thương nhu mô phổi 2 bên.\r\n      - Cấu trúc rốn phổi: Chưa ghi nhận hình ảnh bất thường.\r\n\r\n* Trung thất:\r\n      - Bóng tim: Trong giới hạn bình thường.\r\n      - Các mạch máu chính: Trong giới hạn bình thường.\r\n\r\n* Ghi nhận khác: Hiện tại không có ghi nhận khác.', 'HIỆN TẠI CHƯA GHI NHẬN BẤT THƯỜNG TRÊN PHIM', '2025-05-18 12:35:55', '2025-05-30 04:35:16'),
(31, 'XQUANG CỘT SỐNG CỔ CHẾCH', 'X-quang', '- Lỗ liên hợp bên (P): Trong giới hạn bình thường.\r\n\r\n- Lỗ liên hợp bên (T): Trong giới hạn bình thường.\r\n\r\n- Khoảng gian đốt sống cổ: Trong giới hạn bình thường.', 'Hiện tại chưa ghi nhận hình ảnh bất thường trên phim.', '2025-05-18 13:37:23', '2025-05-18 13:43:49'),
(32, 'XQUANG CỘT SỐNG CỔ THẲNG NGHIÊNG', 'X-quang', '- Các đường cong sinh lý cạnh cột sống: Không thấy bất thường.\r\n\r\n- Các đốt sống cổ: Chưa phát hiện tổn thương. \r\n\r\n- Khoảng gian đốt sống cổ: Trong giới hạn bình thường.', 'Hiện tại chưa ghi nhận hình ảnh bất thường trên phim.', '2025-05-18 13:44:24', '2025-05-18 13:45:14'),
(33, 'XQUANG CỘT SỐNG THĂT LƯNG', 'X-quang', '- Các đường cong sinh lý: Trong giới hạn bình thường.\r\n\r\n- Các đốt sống thắt lưng: Không ghi nhận hình ảnh bất thường.\r\n\r\n- Gian đốt sống: Trong giới hạn bình thường.\r\n\r\n- Lỗ liên hợp : Hạn chế khảo sát.\r\n\r\n- Các bộ phận khác: Chưa phát hiện bất thường.', 'Hiện tại chưa ghi nhận hình ảnh bất thường trên phim Xquang.', '2025-05-18 13:45:07', '2025-05-18 13:45:07'),
(34, 'XQUANG VAI', 'X-quang', '- Đầu trên  xương cánh tay: Chưa phát hiện bất thường.\r\n\r\n- Mỏm cùng đòn: Chưa phát hiện bất thường.\r\n\r\n- Xương bả vai: Chưa phát hiện bất thường.\r\n\r\n- Xương đòn: Chưa phát hiện bất thường.', 'Chưa phát hiện bất thường trên phim Xquang.', '2025-05-18 13:45:43', '2025-05-18 13:56:05'),
(35, 'XQUANG CÁNH TAY', 'X-quang', '- Cấu trúc xương cánh tay: Chưa ghi nhận bất thường\r\n\r\n- Khớp vai: Chưa ghi nhận bất thường\r\n\r\n- Khớp khủyu: Chưa ghi nhận bất thường', 'Chưa phát hiện bất thường trên phim Xquang.', '2025-05-18 13:46:31', '2025-05-18 13:46:31'),
(36, 'XQUANG KHUỶU TAY', 'X-quang', '- Cấu trúc đầu dưới xương cánh tay: Chưa ghi nhận tổn thương.\r\n\r\n\r\n\r\n- Cấu trúc đầu trên xương trụ: Chưa ghi nhận tổn thương.\r\n\r\n\r\n\r\n- Cấu trúc đầu trên xương quay: Chưa ghi nhận tổn thương.', 'Chưa phát hiện bất thường trên phim Xquang.', '2025-05-18 13:46:45', '2025-05-18 13:46:45'),
(37, 'XQUANG CẲNG TAY', 'X-quang', '- Cấu trúc xương trụ: Chưa ghi nhận tổn thương.\r\n\r\n\r\n\r\n- Cấu trúc xương quay: Chưa ghi nhận tổn thương.\r\n\r\n\r\n\r\n- Khớp khủyu: Chưa ghi nhận tổn thương.\r\n\r\n\r\n\r\n - Khớp cổ tay: Chưa ghi nhận tổn thương.', 'Chưa phát hiện bất thường trên phim Xquang.', '2025-05-18 13:47:03', '2025-05-18 13:47:03'),
(38, 'XQUANG CỔ TAY', 'X-quang', '- Cấu trúc đầu dưới xương quay: Chưa phát hiện tổn thương. \r\n\r\n\r\n\r\n- Cấu trúc đầu dưới xương trụ: Chưa phát hiện tổn thương.\r\n\r\n\r\n\r\n- Cấu trúc các xương cổ tay: Chưa phát hiện tổn thương. \r\n\r\n\r\n\r\n- Khe khớp: Trong giới hạn bình thường.', 'Chưa phát hiện bất thường trên phim Xquang.', '2025-05-18 13:47:24', '2025-05-18 13:47:24'),
(39, 'XQUANG BÀN TAY', 'X-quang', '- Cấu trúc các xương đốt bàn: Không ghi nhận bất thương.\r\n\r\n\r\n\r\n- Cấu trúc các xương đốt ngón: Không ghi nhận bất thương.\r\n\r\n\r\n\r\n- Cấu trúc các xương cổ tay: Không ghi nhận bất thương.\r\n\r\n\r\n\r\n- Các khe khớp: Không hẹp khe khớp.', 'Hiện tại chưa ghi nhận bất thường trên phim.', '2025-05-18 13:47:42', '2025-05-18 13:47:42'),
(40, 'XQUANG KHUNG CHẬU', 'X-quang', '- Cấu trúc xương chậu: Không ghi nhận tổn thương\r\n\r\n- Cấu trúc đầu trên xương đùi hai bên: Không ghi nhận tổn thương\r\n\r\n- Cấu trúc chiều dài cổ xương đùi: Không ghi nhận bất  thường\r\n\r\n- Đường shenton: Không biến dạng\r\n\r\n- Ghi nhận khác: Không ghi nhận tổn thương', 'Hiện không ghi nhận tổn thương xương vùng chậu', '2025-05-18 13:48:08', '2025-05-18 13:48:08'),
(41, 'XQUANG XƯƠNG ĐÙI', 'X-quang', '- Cấu trúc mô mềm đùi: Không hình ảnh bất thường.   \r\n\r\n\r\n\r\n- Cấu trúc xương đùi: Không hình ảnh bất thường. \r\n\r\n\r\n\r\n- Ghi nhận khác: Không có', 'Hiện tại chưa ghi nhận bất thường trên phim.', '2025-05-18 13:48:28', '2025-05-18 13:48:28'),
(42, 'XQUANG KHỚP GỐI', 'X-quang', '- Cấu trúc mô mềm: Chưa ghi nhận hình ảnh bất thường.\r\n\r\n\r\n\r\n- Cấu trúc 1/3 dưới xương đùi: Chưa ghi nhận hình ảnh bất thường.\r\n\r\n\r\n\r\n- Cấu trúc xương bánh chè: Chưa ghi nhận hình ảnh bất thường.\r\n\r\n\r\n\r\n- Cấu trúc 1/3  trên xương chày: Chưa ghi nhận hình ảnh bất thường.\r\n\r\n\r\n\r\n- Cấu trúc 1/3  trên xương mác: Chưa ghi nhận hình ảnh bất thường.\r\n\r\n\r\n\r\n- Khe khớp gối: Trong giới hạn bình thường.', 'Hiện tại chưa ghi nhận bất thường trên phim.', '2025-05-18 13:48:59', '2025-05-18 13:48:59'),
(43, 'XQUANG CẲNG CHÂN', 'X-quang', '- Cấu trúc xương chày: Chưa phát hiện tổn thương.\r\n\r\n\r\n\r\n- Cấu trúc xương mác: Chưa phát hiện tổn thương.\r\n\r\n\r\n\r\n- Ghi nhận khác: Không có.', 'Hiện tại chưa ghi nhận bất thường trên phim.', '2025-05-18 13:49:20', '2025-05-18 13:49:20'),
(44, 'XQUANG CỔ CHÂN', 'X-quang', '- Cấu trúc đầu dưới  xương chày: Chưa ghi nhận tổn thương.\r\n\r\n- Cấu trúc đầu dưới xương mác: Chưa ghi nhận tổn thương.\r\n\r\n- Cấu trúc các xương cổ chân: Chưa ghi nhận tổn thương. \r\n\r\n- Cấu trúc các xương bàn chân: Chưa ghi nhận tổn thương.\r\n\r\n- Khe khớp: Không hẹp khe khớp.', 'Hiện tại chưa ghi nhận bất thường trên phim.', '2025-05-18 13:49:47', '2025-05-18 13:49:47'),
(45, 'XQUANG BÀN CHÂN', 'X-quang', '- Cấu trúc xương cổ chân + gót chân: Chưa phát hiện tổn thương.\r\n\r\n\r\n\r\n- Cấu trúc các xương bàn chân: Chưa phát hiện tổn thương. \r\n\r\n\r\n\r\n- Cấu trúc xương ngón chân: Chưa phát hiện tổn thương.\r\n\r\n\r\n\r\n- Khe khớp: Trong giới hạn bình thường.\r\n\r\n\r\n\r\n- Xương vừng: Chưa phát hiện tổn thương.', 'Hiện tại chưa ghi nhận bất thường trên phim.', '2025-05-18 13:50:06', '2025-05-18 13:50:06'),
(46, 'XQUANG XƯƠNG GÓT', 'X-quang', '- Xương gót: Chưa ghi nhận tổn  thương\r\n\r\n- Ghi nhận khác: Chưa ghi nhận tổn  thương\r\n\r\n- Góc Bohler: >20°.', 'Hiện tại chưa ghi nhận bất thường trên phim.', '2025-05-18 13:50:31', '2025-05-18 13:50:31'),
(47, 'XQUANG  BỤNG ĐỨNG', 'X-quang', '- Liềm hơi dưới hoành 2 bên:  Hiện tại chưa phát hiện bất thường.\r\n\r\n\r\n\r\n- Mực nước hơi bất thường: Trong giới hạn bình thường\r\n\r\n\r\n\r\n- Đóng vôi bất thường trong ổ bụng: Hiện tại chưa phát hiện bất thường.\r\n\r\n\r\n\r\n- Ghi nhận khác: Không có.', 'Hiện tại chưa ghi nhận bất thường trên phim.', '2025-05-18 13:50:48', '2025-05-18 13:50:48'),
(48, 'XQUANG SỌ', 'X-quang', '* Cấu trúc mô mềm: Không phát hiện hình ảnh bất thường trên phim.\r\n\r\n\r\n\r\n* Cấu trúc xương hộp sọ: Không phát hiện hình ảnh bất thường trên phim.\r\n\r\n\r\n\r\n* Các khớp sọ: Trong giới hạn bình thường.\r\n\r\n\r\n\r\n* Ghi nhận khác: Không có.', 'Hiện tại chưa ghi nhận bất thường trên phim.', '2025-05-18 13:51:08', '2025-05-18 13:51:08'),
(49, 'XQUANG BLONDEAU', 'X-quang', '- Cấu trúc các xương: Không ghi nhận tổn thương.\r\n\r\n- Vách ngăn mũi: Trong giới hạn bình thường.\r\n\r\n- Cấu trúc và độ sáng các xoang hàm hai bên: Trong giới hạn bình thường.\r\n\r\n- Cấu trúc và độ sáng các xoang trán hai bên: Trong giới hạn bình thường.\r\n\r\n- Cấu trúc và độ sáng các xoang sàng hai bên:Trong giới hạn bình thường.\r\n\r\n- Ghi nhận khác: Không.', 'Hiện tại chưa ghi nhận bất thường trên phim.', '2025-05-18 13:51:28', '2025-05-18 13:51:28'),
(50, 'XQUANG HITZ', 'X-quang', '- Cấu trúc các xương: Không ghi nhận tổn thương.\r\n\r\n\r\n\r\n- Cấu trúc và độ sáng các xoang hàm hai bên: Không ghi nhận tổn thương.\r\n\r\n\r\n\r\n- Cấu trúc và độ sáng các xoang sàng hai bên: Không ghi nhận tổn thương.\r\n\r\n\r\n\r\n - Ghi nhận khác: Không có.', 'Hiện tại chưa ghi nhận hình ảnh bất thường trên phim Xquang.', '2025-05-18 13:51:48', '2025-05-18 13:51:48'),
(51, 'XQUANG XƯƠNG MŨI NGHIÊNG', 'X-quang', '- Cấu trúc xương mũi: Chưa ghi nhận bất thường.\r\n\r\n\r\n\r\n- Ghi nhận khác: Không có.', 'Hiện tại chưa ghi nhận hình ảnh bất thường trên phim Xquang.', '2025-05-18 13:52:11', '2025-05-18 13:52:11'),
(52, 'XQUANG XƯƠNG HÀM CHẾCH', 'X-quang', '- Xương hàm dưới: Không ghi nhận hình ảnh bất thường.\r\n\r\n\r\n- Ghi nhận khác: Không.', 'Hiện tại chưa ghi nhận hình ảnh bất thường trên phim Xquang.', '2025-05-18 13:52:32', '2025-05-18 13:52:58'),
(53, 'Hệ niệu không chuẩn bị (KUB).', 'X-quang', '*  Bóng thận hai bên: Trong giới hạn bình thường.\r\n\r\n\r\n\r\n* Không ghi nhận hình ảnh sỏi cản quang hệ niệu.\r\n\r\n\r\n\r\n*  Các bộ phận khác: Không ghi nhận bất thương.', 'Hiện tai không phát hiện hình ảnh sỏi cản quang hệ niệu trên phim KUB.', '2025-05-18 13:53:58', '2025-05-18 13:53:58'),
(54, 'SIÊU ÂM TUYẾN VÚ HAI BÊN', 'Siêu âm', 'I. VÚ PHẢI:    \r\n- Mô dưới da: Echo kém, trong giới hạn bình thường.    \r\n- Mô tuyến vú: Echo dày, cấu trúc đồng nhất, mô sợi và mô tuyến vú phân bố đều.    \r\n- Tổn thương khu trú: Không.  \r\n- Hạch: Không.   \r\n II. VÚ TRÁI:    \r\n- Mô dưới da: Echo kém, trong giới hạn bình thường.    \r\n- Mô tuyến vú: Echo dày, cấu trúc đồng nhất, mô sợi và mô tuyến vú phân bố đều.    \r\n- Tổn thương khu trú: Không.    \r\n- Hạch: Không', 'Hiện tại chưa phát hiện bệnh lý trên siêu âm', '2025-05-18 13:54:54', '2025-05-27 14:40:47'),
(55, 'SIÊU ÂM THAI QUÝ 1', 'Siêu âm', '* Tử cung: Trung gian, DAP = mm, lòng tử cung có 01 túi thai, bờ đều căng tròn, bên trong có yolksac, có phôi.\r\n*Tim thai (+)  lần/phút.\r\n* GS: mm\r\n* CRL:  mm\r\n* Buồng trứng phải: chưa ghi nhận bất thường.\r\n* Buồng trứng trái: chưa ghi nhận bất thường.\r\n* Túi cùng: không dịch \r\n* Ngày dự sanh (dương lịch):', 'MỘT TÚI THAI TRONG LÒNG TỬ CUNG, TUỔI THAI KHOẢNG  TUẦN.', '2025-05-18 14:00:31', '2025-05-27 14:40:56'),
(56, 'SIÊU ÂM THAI QUÝ 2', 'Siêu âm', '- 1/ Số thai: 01\r\n     + Ngôi thai: Di động\r\n     + Tim thai (+):  lần/phút, đều rõ\r\n- 2/ Nhau - dây rốn: \r\n    + Vi trí: bám mặt trước thân tử cung.\r\n     + Độ trưởng thành: 1\r\n     + Nhóm:  I  \r\n- 3/ Nước ối: Bình thường\r\n- 4/ Chỉ số sinh học:\r\n+ Đường kính lưỡng đỉnh (BPD): mm \r\n+ Chiều dài xương đùi (FL):  mm\r\n+ Chu vi vòng bụng (AC):  mm\r\n- 5/ Ước lượng tuổi thai:  tuần\r\n- 6/ Ước lượng cân nặng: # g\r\n\r\n- 7/ Dự sanh (dương lịch): (theo dự sanh 3 tháng đầu)\r\n\r\n- 8/ Bất thường: Không phát hiện bất thường', 'Một thai sống trong lòng tử cung, tuổi thai khoảng  tuần. Ngôi di động - Nước ối trung bình.', '2025-05-18 14:01:17', '2025-05-27 14:41:12'),
(57, 'SIÊU ÂM THAI QUÝ 3', 'Siêu âm', '1/ Số thai : 01    \r\n     + Ngôi thai: Đầu. \r\n     + Tim thai (+): lần/phút, đều rõ                        \r\n2/ Nhau - dây rốn:\r\n      +  Vị trí : Bám mặt trước thân tử cung. \r\n      + Nhóm:   I                 \r\n      + Độ trưởng thành:    3                                    \r\n3/ Nước ối:  AFI#  cm                  \r\n4/Chỉ số sinh học :\r\n              + ĐK lưỡng đỉnh (BPD): mm\r\n              + Chiều dài xương đùi: FL: mm\r\n              + Chu vi bụng (AC): mm        \r\n5/ Ước lượng cân nặng: # g             \r\n6/ Ước lượng tuổi thai: # tuần     \r\n7/Dự sanh (dương lịch): (theo dự sanh 3 tháng đầu)                                          \r\n8/Cơ quan khác:', 'Một thai sống trong lòng tử cung, tuổi thai khoảng  tuần. Ngôi thuận - Nước ối AFI# cm.', '2025-05-18 14:01:46', '2025-05-27 14:41:16'),
(58, 'SIÊU ÂM TUYẾN GIÁP', 'Siêu âm', '- Thùy phải: Kích thước không to, cấu trúc đồng nhất, không tăng sinh mạch máu.\r\n   + Đường kính ngang:  mm\r\n   + Đường kính dọc:  mm\r\n   + Bề dày:  mm\r\n   + Tổn thương khu trú: Chưa ghi nhận.\r\n - Thùy trái: Kích thước không to, cấu trúc đồng nhất, không tăng sinh mạch máu.\r\n   + Đường kính ngang:  mm\r\n   + Đường kính dọc:  mm\r\n   + Bề dày:  mm.\r\n   + Tổn thương khu trú: Chưa ghi nhận.\r\n- Eo giáp:  mm\r\n- Hạch cổ: Không phát hiện hạch bất thường.\r\n- Hạch góc hàm: Không phát hiện hạch bất thường.\r\n- Ghi nhận khác: Không có.', 'Hiện tại chưa phát hiện bất thường trên siêu âm.', '2025-05-18 14:02:06', '2025-05-27 14:41:32'),
(59, 'SIÊU ÂM TỔNG QUÁT NAM', 'Siêu âm', '- Gan: Phản âm đồng nhất, bờ đều, kích thước không lớn.\r\n- Túi mật: Túi mật không sỏi, thành không dày, đường mật trong ngoài gan không dãn.\r\n- Tụy: Phản âm đồng nhất, kích thước không lớn.\r\n- Lách: Phản âm đồng nhất, kích thước không lớn.\r\n- Thận phải: Không sỏi, không ứ nước, phân biệt vỏ tuỷ rõ.\r\n- Thận trái:  Không sỏi, không ứ nước, phân biệt vỏ tuỷ rõ.\r\n- Bàng quang: Không sỏi, thành không dày.\r\n- Tiền liệt tuyến : Cấu trúc đồng nhất, kích thước không to.\r\n- Dịch ở bụng, dịch màng phổi: Không có.\r\n- Ghi nhận khác: Không.', 'Hiện tại chưa phát hiện hình ảnh bất thường trên siêu âm.', '2025-05-18 14:02:23', '2025-05-27 14:41:42'),
(60, 'SIÊU ÂM TỔNG QUÁT NỮ', 'Siêu âm', '- Gan: Phản âm đồng nhất, bờ gan đều, kích thước không lớn.\r\n- Mật: Túi mật không sỏi, thành không dày, đường mật trong ngoài gan không dãn.\r\n- Tụy: Phản âm đồng nhất, kích thước không lớn.\r\n- Lách: Phản âm đồng nhất, kích thước không lớn. \r\n- Thận phải: Không sỏi, không ứ nước, phân biệt vỏ tuỷ rõ.\r\n- Thận trái: Không sỏi, không ứ nước, phân biệt vỏ tuỷ rõ.\r\n- Bàng quang: Không sỏi, thành không dày.\r\n- Tử cung: Trung gian, DAP mm, nội mạc mỏng, cấu trúc đồng nhất.\r\n- Hai phần phụ:  \r\n         + P: Chưa ghi nhận bất thường.\r\n        + T: Chưa ghi nhận bất thường.\r\n- Dịch ở bụng, dịch màng phổi: Không có.\r\n- Ghi nhận khác: Không.', 'Hiện tại chưa phát hiện bệnh lý trên siêu âm.', '2025-05-18 14:02:36', '2025-05-27 14:41:53'),
(61, 'SIÊU ÂM TỔNG QUÁT NỮ- MÃN KINH', 'Siêu âm', '- Gan: Phản âm đồng nhất, bờ gan đều, kích thước không lớn.\r\n- Mật: Túi mật không sỏi, thành không dày, đường mật trong ngoài gan không dãn.\r\n- Tụy: Phản âm đồng nhất, kích thước không lớn.\r\n- Lách: Phản âm đồng nhất, kích thước không lớn. \r\n- Thận phải: Không sỏi, không ứ nước, phân biệt vỏ tuỷ rõ.\r\n- Thận trái: Không sỏi, không ứ nước, phân biệt vỏ tuỷ rõ.\r\n- Bàng quang: Không sỏi, thành không dày.\r\n- Tử cung: Trung gian, DAP mm, nội mạc mỏng, cấu trúc đồng nhất.\r\n- Hai phần phụ:  Khó khảo sát.\r\n- Dịch ở bụng, dịch màng phổi: Không có.\r\n- Ghi nhận khác: Không.', 'Hiện tại chưa phát hiện bệnh lý trên siêu âm.', '2025-05-18 14:03:06', '2025-05-27 14:42:18'),
(62, 'SIÊU ÂM TỬ CUNG PHẦN PHỤ', 'Siêu âm', '- Tử cung: Trung gian,  DAP=  mm, cấu trúc cơ tử cung đồng dạng.\r\n- Nội mạc: mm\r\n- Buồng trứng trái: Chưa ghi nhận bất thường.\r\n- Buồng trứng phải: Chưa ghi nhận bất thường\r\n- Túi cùng: Không có dịch.', 'HIỆN TẠI CHƯA GHI NHẬN BẤT THƯỜNG TRÊN SIÊU ÂM.', '2025-05-18 14:03:21', '2025-05-27 14:42:24'),
(63, 'Siêu âm mô mềm', 'Siêu âm', 'Mô mềm vị trí:\n-', 'Hiện tại chưa ghi nhận hình ảnh bất thường trên siêu âm.', '2025-05-18 14:03:55', '2025-05-18 14:03:55'),
(64, 'SIÊU ÂM TĨNH MẠCH CHI DƯỚI', 'Siêu âm', 'Mô tả siêu âm doppler hệ tĩnh mạch chi dưới hai bên.\r\n- Hình ảnh siêu âm 2D\r\n   + Hệ tĩnh mạch hai chi dưới không dãn, còn mềm mại, dễ đè xẹp, không có huyết khối trong lòng.\r\n- Hình ảnh siêu âm DOPPLER\r\n    + Hệ tĩnh mạch sâu: Phổ tĩnh mạch sâu chi dưới hai bên thay đổi tốt theo hô hấp, có dòng phổ âm đi ngược dòng phổ chính khi hít thở sâu và làm các nghiệm pháp,  bên phải T= s, bên trái T= s\r\n    + Hệ tĩnh mạch nông: Phổ tĩnh mạch nông chi dưới hai bên thay đổi tốt theo hô hấp, có dòng phổ âm đi ngược dòng phổ chính khi hít thở sâu và làm các nghiệm pháp,  bên phải T= s, bên trái T= s\r\n- Ghi nhận khác: không.', 'CHƯA GHI NHẬN HÌNH ẢNH BẤT THƯỜNG TRÊN SIÊU ÂM DOPPLER HỆ TĨNH MẠCH CHI DƯỚI HAI BÊN.', '2025-05-18 14:04:49', '2025-05-18 14:04:49'),
(65, 'SIÊU ÂM ĐỘNG MẠCH CẢNH', 'Siêu âm', '1. Động mạch\r\n- Hình ảnh 2D\r\n  + Hệ động mạch cảnh chung (IMT bên phải = mm, IMT bên trái = mm), cảnh trong, cảnh ngoài hai bên không dày, không xơ vữa, không tắc hẹp, không phình và bóc tách thành mạch, không có huyết khối trong lòng.\r\n  + Động mạch đốt sống hai bên: dòng chảy hướng não.\r\n  + Không có thông nối động - tĩnh mạch.\r\n- DOPPLER\r\n   + Phổ động mạch cảnh có vận tốc và phổ bình thường, không có vùng bắt màu bất thường, không có ổ tăng vận tốc khu trú.\r\n2. Tĩnh mạch\r\n- Hình ảnh 2D\r\n   + Hệ tĩnh mạch cảnh không dãn, còn mềm mại, dễ đè xẹp, không có huyết khối trong lòng.\r\n   + Không có thông nối động - tĩnh mạch', 'HIỆN TẠI CHƯA GHI NHẬN BẤT THƯỜNG TRÊN SIÊU ÂM DOPPLER HỆ ĐỘNG MẠCH CẢNH NGOÀI SỌ.', '2025-05-18 14:05:06', '2025-06-26 10:38:59'),
(67, 'SIÊU ÂM DOPPLER TIM', 'Siêu âm', '- IVSd: mm        LVDd: mm    LVPWd: mm\r\n- IVSs: mm        LVDs: mm    LVPWs: mm \r\n- EF :   %        FS :   %\r\n- RV: mm;   AO: mm;  AVD: mm;  LA: mm.\r\n    1. Van động mạch phổi:  Hở van (-), Hẹp van (-)\r\n         - Vmax:   m/s,     Gpeak :   mmHg\r\n    2. Van 2 lá:  Hở van (-), Hẹp van (-)\r\n        -  Vmax:    m/s, Gpeak:  mmHg, E/A >1\r\n    3. Van động mạch chủ: Hở van (-), Hẹp van (-)\r\n        -  Vmax:     m/s,     Gpeak:    mmHg\r\n    4. Van 3 lá: Hở van (-), Hẹp van (-)\r\n       - Vmax: m/s, Gpeak: mmHg, PAPs: mmHg\r\n    5. Dòng bất thường qua vách liên thất:Không\r\n    6. Dòng bất thường qua vách liên nhĩ:Không', '- Không ghi nhận rối loạn vận động vùng.\r\n- Chức năng tâm thu thất trái bảo tồn, \r\nEF#  % (theo Teicholz) \r\n- Hở van 2 lá 1/4, hở van 3 lá 1/4. \r\n- Không tăng áp lực động mạch phổi.', '2025-05-18 14:06:06', '2025-06-26 10:37:17'),
(71, 'HUYẾT HỌC', 'Xét nghiệm', '[\r\n  {\r\n    \"indication\": \"WBC\",\r\n    \"result\": null,\r\n    \"unit\": \"10^9/L\",\r\n    \"normal_range\": \"4.0 - 10.0\"\r\n  },\r\n  {\r\n    \"indication\": \"LYM %\",\r\n    \"result\": null,\r\n    \"unit\": \"%\",\r\n    \"normal_range\": \"20.0 - 40.0\"\r\n  },\r\n  {\r\n    \"indication\": \"MID %\",\r\n    \"result\": null,\r\n    \"unit\": \"%\",\r\n    \"normal_range\": \"1.0 - 15.0\"\r\n  },\r\n  {\r\n    \"indication\": \"NEU %\",\r\n    \"result\": null,\r\n    \"unit\": \"%\",\r\n    \"normal_range\": \"50.0 - 70.0\"\r\n  },\r\n  {\r\n    \"indication\": \"LYM #\",\r\n    \"result\": null,\r\n    \"unit\": \"10^9/L\",\r\n    \"normal_range\": \"0.6 - 4.1\"\r\n  },\r\n  {\r\n    \"indication\": \"MID #\",\r\n    \"result\": null,\r\n    \"unit\": \"10^9/L\",\r\n    \"normal_range\": \"0.1 - 1.8\"\r\n  },\r\n  {\r\n    \"indication\": \"NEU #\",\r\n    \"result\": null,\r\n    \"unit\": \"10^9/L\",\r\n    \"normal_range\": \"2.0 - 7.8\"\r\n  },\r\n  {\r\n    \"indication\": \"RBC\",\r\n    \"result\": null,\r\n    \"unit\": \"10^12/L\",\r\n    \"normal_range\": \"3.50 - 5.50\"\r\n  },\r\n  {\r\n    \"indication\": \"HGB\",\r\n    \"result\": null,\r\n    \"unit\": \"g/DL\",\r\n    \"normal_range\": \"11.0 - 15.0\"\r\n  },\r\n  {\r\n    \"indication\": \"HCT\",\r\n    \"result\": null,\r\n    \"unit\": \"%\",\r\n    \"normal_range\": \"36.0 -48.0\"\r\n  },\r\n  {\r\n    \"indication\": \"MCV\",\r\n    \"result\": null,\r\n    \"unit\": \"fl\",\r\n    \"normal_range\": \"80.0 - 99.0\"\r\n  },\r\n  {\r\n    \"indication\": \"MCH\",\r\n    \"result\": null,\r\n    \"unit\": \"pg\",\r\n    \"normal_range\": \"26.0 - 32.0\"\r\n  },\r\n  {\r\n    \"indication\": \"MCHC\",\r\n    \"result\": null,\r\n    \"unit\": \"g/dL\",\r\n    \"normal_range\": \"32.0 - 36.0\"\r\n  },\r\n  {\r\n    \"indication\": \"RDW\",\r\n    \"result\": null,\r\n    \"unit\": \"%\",\r\n    \"normal_range\": \"11.5 - 14.5\"\r\n  },\r\n  {\r\n    \"indication\": \"PLT\",\r\n    \"result\": null,\r\n    \"unit\": \"10^9/L\",\r\n    \"normal_range\": \"150 - 390\"\r\n  },\r\n  {\r\n    \"indication\": \"MPV\",\r\n    \"result\": null,\r\n    \"unit\": \"fl\",\r\n    \"normal_range\": \"7.4 -10.4\"\r\n  },\r\n  {\r\n    \"indication\": \"Nhóm máu ABO, Rh\",\r\n    \"result\": null,\r\n    \"unit\": null,\r\n    \"normal_range\": null\r\n  }\r\n]', '', '2025-05-29 12:20:28', '2025-07-18 11:22:13'),
(72, 'TỔNG PHÂN TÍCH NƯỚC TIỂU', 'Xét nghiệm', '[\n  {\n    \"indication\": \"LEU\",\n    \"result\": null,\n    \"unit\": \"Leu/µL\",\n    \"normal_range\": \"Âm tính\"\n  },\n  {\n    \"indication\": \"NIT\",\n    \"result\": null,\n    \"unit\": null,\n    \"normal_range\": \"Âm tính\"\n  },\n  {\n    \"indication\": \"UBG\",\n    \"result\": null,\n    \"unit\": \"µmol/L\",\n    \"normal_range\": \"<30\"\n  },\n  {\n    \"indication\": \"PRO\",\n    \"result\": null,\n    \"unit\": \"g/L\",\n    \"normal_range\": \"Âm tính\"\n  },\n  {\n    \"indication\": \"PH\",\n    \"result\": null,\n    \"unit\": null,\n    \"normal_range\": \"5.0 - 7.5\"\n  },\n  {\n    \"indication\": \"ERY\",\n    \"result\": null,\n    \"unit\": \"Ery/µL\",\n    \"normal_range\": \"Âm tính\"\n  },\n  {\n    \"indication\": \"SG\",\n    \"result\": null,\n    \"unit\": null,\n    \"normal_range\": \"1.005 - 1.030\"\n  },\n  {\n    \"indication\": \"KET\",\n    \"result\": null,\n    \"unit\": \"mmol/L\",\n    \"normal_range\": \"Âm tính\"\n  },\n  {\n    \"indication\": \"BIL\",\n    \"result\": null,\n    \"unit\": \"µmol/L\",\n    \"normal_range\": \"Âm tính\"\n  },\n  {\n    \"indication\": \"GLU\",\n    \"result\": null,\n    \"unit\": \"mmol/L\",\n    \"normal_range\": \"Âm tính\"\n  }\n]\n', '', '2025-05-29 13:56:54', '2025-05-30 00:28:21'),
(73, 'SINH HÓA', 'Xét nghiệm', '[\r\n  {\r\n    \"indication\": \"Glucose\",\r\n    \"result\": null,\r\n    \"unit\": \"mmol/L\",\r\n    \"normal_range\": \"4.1 - 6.4\"\r\n  },\r\n  {\r\n    \"indication\": \"Ure\",\r\n    \"result\": null,\r\n    \"unit\": \"mmol/L\",\r\n    \"normal_range\": \"2.5 - 7.5\"\r\n  },\r\n  {\r\n    \"indication\": \"Creatinin\",\r\n    \"result\": null,\r\n    \"unit\": \"µmol/L\",\r\n    \"normal_range\": \"Nam: 62 -120 - Nữ: 53 - 100\"\r\n  },\r\n  {\r\n    \"indication\": \"Acid uric\",\r\n    \"result\": null,\r\n    \"unit\": \"µmol/L\",\r\n    \"normal_range\": \"Nữ: 150 - 360 - Nam: 180 - 420\"\r\n  },\r\n  {\r\n    \"indication\": \"AST (GOT)\",\r\n    \"result\": null,\r\n    \"unit\": \"U/L\",\r\n    \"normal_range\": \"≤  37  \"\r\n  },\r\n  {\r\n    \"indication\": \"ALT (GPT)\",\r\n    \"result\": null,\r\n    \"unit\": \"U/L\",\r\n    \"normal_range\": \"≤   40  \"\r\n  },\r\n  {\r\n    \"indication\": \"GGT\",\r\n    \"result\": null,\r\n    \"unit\": \"U/L\",\r\n    \"normal_range\": \"< 55   \"\r\n  },\r\n  {\r\n    \"indication\": \"Total Bilirubin\",\r\n    \"result\": null,\r\n    \"unit\": \"µmol/L\",\r\n    \"normal_range\": \"< 17.1\"\r\n  },\r\n  {\r\n    \"indication\": \"Direct Bilirubin\",\r\n    \"result\": null,\r\n    \"unit\": \"µmol/L\",\r\n    \"normal_range\": \"< 4.3\"\r\n  },\r\n  {\r\n    \"indication\": \"Cholesterol\",\r\n    \"result\": null,\r\n    \"unit\": \"mmol/L\",\r\n    \"normal_range\": \"3.9 - 5.2\"\r\n  },\r\n  {\r\n    \"indication\": \"Triglyceride\",\r\n    \"result\": null,\r\n    \"unit\": \"mmol/L\",\r\n    \"normal_range\": \"0.46 - 1.88\"\r\n  },\r\n  {\r\n    \"indication\": \"HDL-C\",\r\n    \"result\": null,\r\n    \"unit\": \"mmol/L\",\r\n    \"normal_range\": \"≥ 0.9\"\r\n  },\r\n  {\r\n    \"indication\": \"LDL-C\",\r\n    \"result\": null,\r\n    \"unit\": \"mmol/L\",\r\n    \"normal_range\": \"≤ 3.4\"\r\n  },\r\n  {\r\n    \"indication\": \"Protein toàn phần\",\r\n    \"result\": null,\r\n    \"unit\": \"g/L\",\r\n    \"normal_range\": \"55 – 79\"\r\n  },\r\n  {\r\n    \"indication\": \"Albumin\",\r\n    \"result\": null,\r\n    \"unit\": \"mmol/L\",\r\n    \"normal_range\": \"35 - 52\"\r\n  },\r\n  {\r\n    \"indication\": \"Độ Lọc Cầu Thận eGFR\",\r\n    \"result\": null,\r\n    \"unit\": null,\r\n    \"normal_range\": \"≥ 60 ml/ phút/1.73 m2\"\r\n  },\r\n  {\r\n    \"indication\": \"Test HbA1c\",\r\n    \"result\": null,\r\n    \"unit\": \"%\",\r\n    \"normal_range\": \"<5.7%\"\r\n  },\r\n  {\r\n    \"indication\": \"Test HBsAg\",\r\n    \"result\": null,\r\n    \"unit\": null,\r\n    \"normal_range\": \"ÂM TÍNH\"\r\n  },\r\n  {\r\n    \"indication\": \"Test HCV\",\r\n    \"result\": null,\r\n    \"unit\": null,\r\n    \"normal_range\": \"ÂM TÍNH\"\r\n  },\r\n  {\r\n    \"indication\": \"Test HBsAb\",\r\n    \"result\": null,\r\n    \"unit\": null,\r\n    \"normal_range\": \"ÂM TÍNH\"\r\n  },\r\n  {\r\n    \"indication\": \"Test H.Pylori\",\r\n    \"result\": null,\r\n    \"unit\": null,\r\n    \"normal_range\": \"ÂM TÍNH\"\r\n  }\r\n]', '', '2025-05-29 14:08:31', '2025-07-15 05:22:03'),
(77, 'TEST NHANH', 'Xét nghiệm', '[\r\n  {\r\n    \"indication\": \"HBsAg\",\r\n    \"result\": null,\r\n    \"unit\": null,\r\n    \"normal_range\": \"ÂM TÍNH\"\r\n  },\r\n  {\r\n    \"indication\": \"H.pylori Ab\",\r\n    \"result\": null,\r\n    \"unit\": null,\r\n    \"normal_range\": \"ÂM TÍNH\"\r\n  },\r\n  {\r\n    \"indication\": \"Dengue Ag NS1\",\r\n    \"result\": null,\r\n    \"unit\": null,\r\n    \"normal_range\": \"ÂM TÍNH\"\r\n  },\r\n  {\r\n    \"indication\": \"HCV Ab\",\r\n    \"result\": null,\r\n    \"unit\": null,\r\n    \"normal_range\": \"ÂM TÍNH\"\r\n  },\r\n  {\r\n    \"indication\": \"HBsAb\",\r\n    \"result\": null,\r\n    \"unit\": null,\r\n    \"normal_range\": \"ÂM TÍNH\"\r\n  }\r\n]', '', '2025-06-03 23:07:11', '2025-07-01 23:37:21'),
(78, 'TEST NHANH ĐƯỜNG HUYẾT', 'Xét nghiệm', '[\r\n  {\r\n    \"indication\": \"Đường máu mao mạch\",\r\n    \"result\": null,\r\n    \"unit\": \"mg/dl\",\r\n    \"normal_range\": \"75 - 115\"\r\n  }\r\n]', '', '2025-06-03 23:12:15', '2025-06-03 23:12:15'),
(79, 'HBA1C', 'Xét nghiệm', '[\r\n  {\r\n    \"indication\": \"Test HbA1C\",\r\n    \"result\": null,\r\n    \"unit\": \"%\",\r\n    \"normal_range\": \"< 5.7%\"\r\n  }\r\n]', '', '2025-06-13 05:05:03', '2025-06-13 05:05:03'),
(80, 'BỘ ĐƯỜNG', 'Xét nghiệm', '[\r\n  {\r\n    \"indication\": \"Định lượng Glucose\",\r\n    \"result\": null,\r\n    \"unit\": \"mmol/ L\",\r\n    \"normal_range\": \"3.9 -5.2\"\r\n  },\r\n  {\r\n    \"indication\": \"HbA1C\",\r\n    \"result\": null,\r\n    \"unit\": \"%\",\r\n    \"normal_range\": \"< 5.7%\"\r\n  }\r\n]', '', '2025-06-14 07:59:57', '2025-06-14 07:59:57'),
(81, 'CANXI', 'Xét nghiệm', '[\r\n  {\r\n    \"indication\": \"Canxi toàn phần\",\r\n    \"result\": null,\r\n    \"unit\": \"mmol/L\",\r\n    \"normal_range\": \"2.15 - 2.6\"\r\n  },\r\n  {\r\n    \"indication\": null,\r\n    \"result\": null,\r\n    \"unit\": null,\r\n    \"normal_range\": null\r\n  }\r\n]', '', '2025-06-14 08:02:28', '2025-06-14 08:02:28'),
(82, 'ĐIỆN GIẢI ĐỒ', 'Xét nghiệm', '[\r\n  {\r\n    \"indication\": \"Na+\",\r\n    \"result\": null,\r\n    \"unit\": \"mmol/L\",\r\n    \"normal_range\": \"136 - 146\"\r\n  },\r\n  {\r\n    \"indication\": \"K+\",\r\n    \"result\": null,\r\n    \"unit\": \"mmol/L\",\r\n    \"normal_range\": \"3.5 - 5.1\"\r\n  },\r\n  {\r\n    \"indication\": \"Cl-\",\r\n    \"result\": null,\r\n    \"unit\": \"mmol/L\",\r\n    \"normal_range\": \"96 - 110\"\r\n  },\r\n  {\r\n    \"indication\": \"Ca2+\",\r\n    \"result\": null,\r\n    \"unit\": \"mmol/L\",\r\n    \"normal_range\": \"1.17 - 1.29\"\r\n  }\r\n]', '', '2025-06-14 08:04:33', '2025-06-14 08:04:33');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `name` varchar(60) NOT NULL,
  `username` varchar(50) NOT NULL,
  `password` varchar(50) NOT NULL,
  `role` varchar(30) NOT NULL,
  `sig_img` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `username`, `password`, `role`, `sig_img`) VALUES
(19, 'quyennt', 'quyennt', '123456', 'user', NULL),
(20, 'quyennt', 'bsquyen', '123456789', 'admin', NULL),
(21, 'Lư Ngọc Hân', 'hanln', '123456', 'user', NULL),
(22, 'Lương Thị Bích Tuyền', 'tuyenltb', '123456', 'user', NULL),
(30, 'BS.CKI - NGUYỄN THANH QUYỀN', 'tynt', '1', 'admin', '28ea41a1-50b0-4b33-a780-5639863493d2.png');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `diagnoses`
--
ALTER TABLE `diagnoses`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `doctor_notes`
--
ALTER TABLE `doctor_notes`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `examinations`
--
ALTER TABLE `examinations`
  ADD PRIMARY KEY (`id`),
  ADD KEY `patient_id` (`patient_id`),
  ADD KEY `examinations_ibfk_2` (`diagnosis_id`),
  ADD KEY `examinations_ibfk_3` (`doctor_note_id`);

--
-- Indexes for table `examination_medications`
--
ALTER TABLE `examination_medications`
  ADD PRIMARY KEY (`id`),
  ADD KEY `examination_id` (`examination_id`),
  ADD KEY `medication_id` (`medication_id`);

--
-- Indexes for table `examination_results`
--
ALTER TABLE `examination_results`
  ADD PRIMARY KEY (`id`),
  ADD KEY `examination_service_id` (`examination_service_id`),
  ADD KEY `template_id` (`template_id`);

--
-- Indexes for table `examination_services`
--
ALTER TABLE `examination_services`
  ADD PRIMARY KEY (`id`),
  ADD KEY `examination_id` (`examination_id`),
  ADD KEY `service_id` (`service_id`);

--
-- Indexes for table `medications`
--
ALTER TABLE `medications`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `patients`
--
ALTER TABLE `patients`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `services`
--
ALTER TABLE `services`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_service_name` (`name`);

--
-- Indexes for table `templates`
--
ALTER TABLE `templates`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `diagnoses`
--
ALTER TABLE `diagnoses`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=291;

--
-- AUTO_INCREMENT for table `doctor_notes`
--
ALTER TABLE `doctor_notes`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `examinations`
--
ALTER TABLE `examinations`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1376;

--
-- AUTO_INCREMENT for table `examination_medications`
--
ALTER TABLE `examination_medications`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1687;

--
-- AUTO_INCREMENT for table `examination_results`
--
ALTER TABLE `examination_results`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1171;

--
-- AUTO_INCREMENT for table `examination_services`
--
ALTER TABLE `examination_services`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3388;

--
-- AUTO_INCREMENT for table `medications`
--
ALTER TABLE `medications`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=81;

--
-- AUTO_INCREMENT for table `patients`
--
ALTER TABLE `patients`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=528;

--
-- AUTO_INCREMENT for table `services`
--
ALTER TABLE `services`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=133;

--
-- AUTO_INCREMENT for table `templates`
--
ALTER TABLE `templates`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=83;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `examinations`
--
ALTER TABLE `examinations`
  ADD CONSTRAINT `examinations_ibfk_1` FOREIGN KEY (`patient_id`) REFERENCES `patients` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `examinations_ibfk_2` FOREIGN KEY (`diagnosis_id`) REFERENCES `diagnoses` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `examinations_ibfk_3` FOREIGN KEY (`doctor_note_id`) REFERENCES `doctor_notes` (`id`);

--
-- Constraints for table `examination_medications`
--
ALTER TABLE `examination_medications`
  ADD CONSTRAINT `examination_medications_ibfk_1` FOREIGN KEY (`examination_id`) REFERENCES `examinations` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `examination_medications_ibfk_2` FOREIGN KEY (`medication_id`) REFERENCES `medications` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `examination_results`
--
ALTER TABLE `examination_results`
  ADD CONSTRAINT `examination_results_ibfk_1` FOREIGN KEY (`examination_service_id`) REFERENCES `examination_services` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `examination_results_ibfk_2` FOREIGN KEY (`template_id`) REFERENCES `templates` (`id`) ON DELETE SET NULL;

--
-- Constraints for table `examination_services`
--
ALTER TABLE `examination_services`
  ADD CONSTRAINT `examination_services_ibfk_1` FOREIGN KEY (`examination_id`) REFERENCES `examinations` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `examination_services_ibfk_2` FOREIGN KEY (`service_id`) REFERENCES `services` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;


use clinic_db2

   SELECT es.id as "es.id" ,s.id as 'Mã CĐ',s.name as 'Tên chỉ định',s.price as 'Giá',s.type,
 CASE 
        WHEN er.examination_service_id IS NULL THEN 'Chưa có KQ'
        ELSE 'Đã có KQ'
    END AS 'Trạng thái',er.result,final_result
FROM examinations e
INNER JOIN examination_services es ON  es.examination_id=e.id
INNER JOIN services s ON s.id=es.service_id
LEFT JOIN examination_results er ON er.examination_service_id=es.id
    Where e.id = 2298
    
  
    DELETE FROM examination_services
WHERE id = 7305;

    
delete from examination_results where id = 2329

select * from examination_results
-----------------------------------------------------------

select * from examinations where id = 346
select * from examination_medications where examination_id = 346


            SELECT
                p.id, 
                p.name,
                SUM(e.price) as total_per_customer
            FROM examinations e
            INNER JOIN patients p ON e.patient_id = p.id
            WHERE p.id = 167 
            AND DATE(e.updated_at) BETWEEN '2025-06-01 00:00:00' AND '2025-06-30 23:59:59'
            GROUP BY p.id, p.name
            
            
                SELECT e.id,e.type,e.price,e.updated_at
                FROM examinations e 
                INNER JOIN patients p ON p.id = e.patient_id
                WHERE p.id = 167
                and DATE(e.updated_at) BETWEEN '2025-06-01 00:00:00' AND '2025-06-30 23:59:59'
                            
         
         
         
                 SELECT  SUM(s.price)           
                 FROM examinations e
                 INNER JOIN examination_services es ON e.id = es.examination_id
                 INNER JOIN services s ON s.id = es.service_id
                 LEFT JOIN examination_results er ON es.id = er.examination_service_id
                 WHERE e.id = 334
                 
               SELECT 
                em.id AS id,
                em.examination_id AS examination_id,
                m.id AS med_id,
                m.name,
                REPLACE(CAST(em.morning AS CHAR), '.', ',') AS morning,
                REPLACE(CAST(em.noon AS CHAR), '.', ',') AS noon,
                REPLACE(CAST(em.afternoon AS CHAR), '.', ',') AS afternoon,
                REPLACE(CAST(em.evening AS CHAR), '.', ',') AS evening,
                em.unit,
                em.days_of_use,
                em.total_quantity_med,
                em.note,
                max(days_of_use) as max
            FROM 
                examination_medications em, examinations e, medications m
            WHERE 
                em.examination_id = e.id
                AND em.medication_id = m.id
                AND em.examination_id = 346
            
                            
                            
SELECT 
    e.id,
    e.type,
    COALESCE(
        e.price,
        (
            SELECT SUM(s.price)
            FROM examination_services es
            INNER JOIN services s ON s.id = es.service_id
            WHERE es.examination_id = e.id
        )
    ) AS price,
    e.updated_at
FROM examinations e 
INNER JOIN patients p ON p.id = e.patient_id
WHERE p.id = 167
  AND DATE(e.updated_at) BETWEEN '2025-06-01' AND '2025-06-30';
  
  
  SELECT 
    em.id AS id,
    em.examination_id AS examination_id,
    m.id AS med_id,
    m.name,
    REPLACE(CAST(em.morning AS CHAR), '.', ',') AS morning,
    REPLACE(CAST(em.noon AS CHAR), '.', ',') AS noon,
    REPLACE(CAST(em.afternoon AS CHAR), '.', ',') AS afternoon,
    REPLACE(CAST(em.evening AS CHAR), '.', ',') AS evening,
    em.unit,
    em.days_of_use,
    em.total_quantity_med,
    em.note,
    MAX(em.days_of_use*50000) OVER () AS total
FROM 
    examination_medications em
INNER JOIN examinations e ON em.examination_id = e.id
INNER JOIN medications m ON em.medication_id = m.id
WHERE 
    em.examination_id = 346;


SELECT 
    e.id,
    e.type,
    CASE
        WHEN e.price IS NOT NULL THEN e.price
        WHEN e.type = 'toa thuốc' THEN
            (SELECT MAX(em.days_of_use) * 50000
             FROM examination_medications em
             WHERE em.examination_id = e.id)
        ELSE 
            (SELECT SUM(s.price)
             FROM examination_services es
             INNER JOIN services s ON es.service_id = s.id
             WHERE es.examination_id = e.id)
    END AS price,
    e.updated_at
FROM examinations e
INNER JOIN patients p ON e.patient_id = p.id
WHERE p.id = 167
  AND DATE(e.updated_at) BETWEEN '2025-06-01' AND '2025-06-30';
  
  SELECT
    p.id,
    p.name,
    SUM(
        CASE
            WHEN e.price IS NOT NULL THEN e.price
            WHEN e.type = 'toa thuốc' THEN
                (SELECT IFNULL(MAX(em.days_of_use) * 50000,0)
                 FROM examination_medications em
                 WHERE em.examination_id = e.id)
            ELSE
                (SELECT IFNULL(SUM(s.price),0)
                 FROM examination_services es
                 INNER JOIN services s ON es.service_id = s.id
                 WHERE es.examination_id = e.id)
        END
    ) AS total_per_customer
FROM examinations e
INNER JOIN patients p ON e.patient_id = p.id
WHERE DATE(e.updated_at) BETWEEN '2025-06-01' AND '2025-06-30'
GROUP BY p.id, p.name;

drop database clinic_db2

create database clinic_db2
use clinic_db2






